{
  "type": "pptx",
  "file": "DHL GT Accelerator_Alignment WS Deck_MSD.pptx",
  "slides": [
    {
      "slide_number": 1,
      "text": [
        "DHL",
        ": Golden Ticket Growth Accelerator",
        "MSD Playback"
      ]
    },
    {
      "slide_number": 2,
      "text": [
        "What’s included",
        "Current state",
        "DHL x MSD ambition ",
        "Objectives to achieve ambition",
        "Success signals",
        "Account readiness analysis (current documents)",
        "Market discovery brief",
        "Next steps",
        "Appendix – Account & document analysis"
      ]
    },
    {
      "slide_number": 3,
      "text": [
        "Diagnosing the current state",
        "Account context",
        "Dual supply chains in Animal Health (Q4 2026 expiry) and Human Health (Q1 2027 expiry).",
        "Growth priorities: doubling chilled capacity in Animal Health; Human Health pivoting to higher-value chilled products.",
        "Exploring automation, AI and specialist handling (LN2 thawing) as cost-down levers.",
        "ESG commitments remain central to supply-chain decisions – sustainability is key.",
        "Visibility is key – portal – and valued within business (and through ",
        "Alloga",
        " partnership)",
        "Previous DHL relationship re-opened in 2024 after loss to ",
        "Alloga",
        " on price. Relationship DHL (Apr 2015-Jan 2022)",
        "Key challenges",
        "Tender intent unclear - MSD describes current activity as a “network study”, whether go to RFP.",
        "Price remains critical; ",
        "Alloga",
        " undercuts with lower unit costs and stronger visibility tools.",
        "Engagement limited to director/procurement level (Julia Gillard, Roger Hall, Dean Shields); Human Health cautious and declining visits.",
        "Competitive set intensifying - ",
        "Alloga",
        ", ",
        "Movianto",
        "/USUM, GXO, KN, ",
        "Avarto",
        " and Great Bear – work in relevant LS and healthcare space.",
        "DHL must evidence near-term automation capacity while positioning Infinity Park (go-live Mar 2027).",
        "Customer understanding of timelines for strong engagement e.g. data on volumes for automation",
        "Knowledge gaps",
        "Verified pallet volumes, throughput and growth outlook (chilled, LN2, thawing flows).",
        "Influence above director level (C-suite, finance, global vs UK decision split).",
        "Extent of ",
        "Alloga’s",
        " service issues vs “patches,” and how MSD perceives them.",
        "MSD’s ESG criteria and decision framework across both divisions.",
        "Channels/events DHL can use to evidence thought leadership.",
        "Intent on RFP – and how we can persuade them to do this",
        "Where UK and Ireland come together in org chart",
        "Global AM – Timo - access to account insight and strategic documents",
        "Alliance (",
        "allianz",
        ") and the ",
        "Alloga",
        " relationship "
      ]
    },
    {
      "slide_number": 4,
      "text": [
        "4",
        "DHLs ambition for ",
        "MSD (long",
        " term)",
        "To be MSD’s transformation partner and shape their long term logistics vision",
        "How we get there:",
        "Evidence DHL’s differentiation vs ",
        "Alloga",
        " through ",
        "the ",
        "creation of an account focused narrative ",
        "and ",
        "targeted proof points",
        ".",
        "Build trust and engagement beyond procurement to influence early and establish DHL as the natural partner for 2026/27.",
        "Establish near-term credibility by positioning DHL’s  innovation and sustainability credentials - creating the bridge to Infinity Park as a long-term solution."
      ]
    },
    {
      "slide_number": 5,
      "text": [
        "Objectives to deliver the ambition",
        "Accelerator objective ",
        "(short term)",
        "Position DHL as MSD’s trusted transformation partner - proving value to business ",
        "(beyond procurement or new IT)",
        ", differentiating from ",
        "Alloga",
        ", and building the case for strategic partnership ahead of 2026/27 tenders.",
        "Value to DHL",
        "€38 million annual revenue (confirm this) ",
        "across Human and Animal Health lines UK.",
        "Live Ireland opportunity - £1.9m ",
        "Flagship UK pharma-automation reference, boosting credibility with ",
        "GxP",
        " (good practice) clients.",
        "Proof point for automation and AI-led efficiency, positioning DHL ahead of ",
        "Alloga",
        " and other competitors in pharma logistics.",
        "Platform to deepen and embed DHL’s MSD relationship beyond the UK and Ireland.",
        "Near-term priorities",
        "Strengthen DHL’s position by moving beyond procurement and building credibility with Animal and Human Health directors (Gillard, Hall, Shields).",
        "Shape MSD’s logistics agenda by aligning to chilled and specialist handling growth (Animal Health Q4 2026; Human Health Q1 2027).",
        "Demonstrate differentiation over ",
        "Alloga",
        " and other competitors  in cost-efficiency, flexibility and visibility - Unlock traction through early proof points showcasing innovation and value",
        "Showcase to MSD the value of early engagement through a champion, detail exactly what they need to share and from who. Reinforcing the value data sharing gets them  to design best solution for them based on current state.",
        "Position Infinity Park as MSD’s long-term supply chain solution (go-live March 2027), reinforcing automation, visibility, and sustainability leadership (sustainability key)."
      ]
    },
    {
      "slide_number": 6,
      "text": [
        "Success signals - how we know we’re on track",
        "Success Signal",
        "Evidence ",
        "Direct engagement with Animal Health leaders secured",
        "MSD’s Animal Health directors visited DHL, showing strong interest in automation and AI as cost-down levers.",
        "Internal champions reactivated ",
        "Long-standing MSD contacts (Julia Gillard, Roger Hall) are re-engaged and can advocate for DHL internally. Engage John Summer-Hayes to strengthen relationship (DHL team).",
        "MSD openness to procurement opportunities/discussions",
        "Centralised",
        " Human and Animal Health procurement teams are active in discussions, signaling intent to explore future opportunities.",
        "Infinity Park positioned as strategic fit",
        "MSD acknowledges DHL’s multi-temperature, automated Infinity Park (go-live Mar 2027) as aligned with their forward supply-chain vision.",
        "Early data-sharing dialogue underway",
        "MSD is considering providing operational data to help DHL shape automation-led solutions in advance of any formal RFP.",
        "Build F2F relationship with human health",
        "Engage on a site visit (MSD or DHL), to build relationships directly – bringing Human Health in line with the warm/openness of Animal",
        "Expanding the strategic scope of discussions",
        "Expanded the discussion of capabilities to dislodge, and differentiate, from competitors – broaden into sustainability, E2E supply chain (LLP), benefits of collective opportunities – efficiencies, cyber (areas of core strength for DHL)"
      ]
    },
    {
      "slide_number": 7,
      "text": [
        "Account readiness ",
        "and market discovery "
      ]
    },
    {
      "slide_number": 8,
      "text": [
        "8",
        "Account analysis - key takeaways ",
        "1. Broaden MSD stakeholder engagement ",
        "DHL can ",
        "leverage MSD’s frustration with ",
        "Alloga’s",
        " rigidity and capacity ",
        "gaps to prove superiority in automation, flexibility and sustainability. ",
        "Building tailored proof points and an account aligned value ",
        "propsition",
        " will counter ",
        "Alloga’s",
        " price-first advantage and ",
        "show DHL as the smarter long-term choice.",
        "DHL ",
        "can broaden engagement beyond Animal Health ",
        "to include Human Health and Procurement, where traction is weaker. ",
        "Mapping the full decision-making unit is essential to understand ",
        "who we need to engage",
        " whilst avoiding over-reliance on Animal Health contacts.",
        "2. Differentiate DHL’s value vs incumbent",
        "3. Shape MSD’s logistics agenda early",
        "DHL can move MSD beyond short-term RFP thinking ",
        "by driving earlier data-sharing and positioning the opportunity for a co-design. ",
        "Deeper account research ",
        "and insight into MSD’s needs will enable DHL to influence requirements ahead of the 2026/27 tenders."
      ]
    },
    {
      "slide_number": 9,
      "text": [
        "Account Readiness Scorecard",
        "Account readiness scorecard",
        "Area",
        "Create",
        "Improve",
        "Validate",
        "Comments",
        "Account strategy and plan",
        "An MSD account deep dive exists that has observations and recommendations but these need to be formulated into an actionable overarching GTM strategy.",
        "Value proposition and messaging",
        "DHL know the value that they are able to offer MSD but need to create an account focused value proposition to support their efforts in activating this account. ",
        "Stakeholder map",
        "Existing view of stakeholders is limited, with a need to broaden engagement across a wider map of stakeholders.",
        "DMU map",
        "Current engagement is limited to director-level supply-chain roles; no view of C-suite / VP decision makers yet,.",
        "Competitor landscape",
        "Competitor research exists at brand level but we need to clearly establish what this means for DHL positioning with MSD.",
        "Customer journey and pain points",
        "DHL understands some core pain points (capacity, inbound bottlenecks, visibility) but these insights are not yet mapped to the full journey",
        "Win/loss insights and learning",
        "There is a top-level understanding as to why DHL lost the MSD account in 2015, but this knowledge needs to be developed with further actionable insights.",
        "Objectives and targets",
        "Although they do not exist in any documentation, there is a clear ambition and set of objectives that DHL wish to achieve for this account.",
        "Data foundation",
        "Acknowledged that data exists across “15 different tools” and is hard to use but there is a good base level of data (win/loss etc.) that exists for this account – this will grow as we learn more about this account.",
        "*All files shared in the ",
        "MSD Golden",
        " Ticket account folder, and after the kick off call have been ",
        "analysed"
      ]
    },
    {
      "slide_number": 10,
      "text": [
        "Growth accelerators – added throughout process",
        "Growth accelerators",
        "Goal",
        "Hypothesis",
        "KPI / Success Metric",
        "Action Plan (next 4-6 wks)",
        "Priority Score¹",
        "Accountable",
        "Map & engage MSD Human Health and Procurement decision-makers",
        "If DHL opens direct dialogue with Human Health & Procurement leaders, trust will grow and DHL can shape pre-RFP criteria.",
        "# new senior contacts",
        "# two-way meetings booked",
        "Run virtual workshop to map stakeholders",
        "Validate & enrich list via warm intros",
        "1",
        "DHL/Magnus",
        "Secure signed data-sharing agreement for pallet volumes & flows",
        "If DHL gains live volume data, we can model savings and reinforce preferred-partner status.",
        "Signed NDA + data-sharing agreement",
        "Dataset received",
        "Draft NDA & data request",
        "Engage MSD stakeholders to align on data sharing",
        "1",
        "DHL",
        "Craft MSD account-focused value proposition",
        "If we tailor DHL’s value proposition to MSD’s priorities (innovation, predictability, integration, ESG), engagement rates and conversions will rise.",
        "Stakeholder “message resonance” feedback",
        "New meetings booked post-campaign",
        "Hold value-prop workshop• ",
        "Draft account-focused message deck",
        "Validate with MSD champions (if possible)",
        "2",
        "Magnus / DHL",
        "Deliver virtual automation demo & invite to on-site tour",
        "If MSD experiences DHL automation virtually, interest in an on-site pilot will rise.",
        "Demo video views",
        "Tour-invite acceptances",
        "Creation of personalised virtual automation demo ",
        "Engage key stakeholders and position site tour",
        "2",
        "DHL",
        "Conduct account research to map MSD landscape & priorities",
        "If DHL uncovers MSD’s strategic priorities, pain points & decision drivers, we can target solutions more precisely and improve win probability.",
        "Research brief approved",
        "# insights integrated into BD materials",
        "Conduct market discovery research ",
        "Utilise in GTM planning and value proposition ",
        "3",
        "Magnus"
      ]
    },
    {
      "slide_number": 11,
      "text": [
        "11",
        "Market Discovery Brief",
        "The Market",
        "Contract timelines: Animal Health expiry Q4 2026; Human Health expiry Q1 2027.",
        "Strategic priorities: cost-down via automation, stronger data visibility, ESG compliance.",
        "Stakeholder landscape: Animal Health (innovation-led) vs Human Health (price-sensitive); procurement influence remains high.",
        "Current pain points: chilled-capacity bottlenecks, rigid inbound slots, fragmented data flow.",
        "Investment outlook: interest in multi-temperature automation ahead of Infinity Park go-live (Mar 2027) and scrapping of expansion into UK due to lack of investment",
        "Any recent news and updates about this account that are relevant to logistics ",
        "Logistics and supply chain trends in pharma and life sciences ",
        "Sector priorities: sustainability, resilience, cost efficiency, digitalisation",
        "Macro impacts: inflation, labour shortages, energy and fuel costs, regulatory pressures",
        "Pharma and animal health logistics under pressure from capacity shortages in chilled and controlled-drug warehousing.",
        "Animal/human – dual use medicines and health",
        "Automation, AI and robotics rising as cost-down and efficiency priorities.",
        "Ongoing need for real-time visibility and order-to-cash integration.",
        "Strong ESG focus: low-carbon warehousing, energy efficiency, sustainability reporting.",
        "3PL linked to wholesaler e.g. ",
        "Alloga",
        " and alliance",
        "The Account",
        "Competitors",
        "Top level positioning and analysis of the top 3 competitors competing for the account, including:​",
        "Alloga",
        " – Owned by alliance healthcare - wholesaler (",
        "Cencora",
        ")",
        "Movianto",
        "/Yusen logistics ",
        "GXO",
        "Nick to check global relationships ",
        "Competitor proof points: case studies in Pharma/life sciences, green logistics, initiatives, automation, accreditations and awards (BRC, ISO, sustainability standards)",
        "Recent competitor news: Facility openings and pharma logistics acquisitions., Digitalisation and AI pilots, Customer wins/renewals in healthcare supply chains."
      ]
    },
    {
      "slide_number": 12,
      "text": [
        "Timeline and next steps"
      ]
    },
    {
      "slide_number": 13,
      "text": [
        "Golden ticket project",
        " flow",
        "Kick off",
        "Brief & docs supplied",
        "Diagnose – Audits & gap analysis",
        "Design – CCC, DMU's & VPs",
        "Week 0",
        "Week 1",
        "Week 2",
        "Week 3",
        "Week 4",
        "Week 5",
        "Week 6",
        "Week 7",
        "Indicative timeline is achievable if we can ensure access to the key stakeholders as is required throughout.",
        "Alignment ",
        "Workshop",
        "Feedback",
        "Discovery presentation",
        "DMU / VP Workshop",
        "DMU / VP Presentation & review call",
        "Build – Persona, messaging themes, personalised content",
        "Persona",
        "Definition workshop",
        "GT Acct & Content",
        "Planning",
        "Outreach sessions 1 & 2",
        "Week 8",
        "Week 9",
        "Week 10",
        "Week 11",
        "Week 12-14",
        "Week 14-16",
        "Week 17-18",
        "Week 19-20",
        "Activiate",
        " – Launch GT account campaigns & monitor",
        "GT Acct kick off",
        "Training session - TBC",
        "Monthly performance review",
        "Monthly performance review (ongoing)",
        "Discovery ",
        "session",
        "30 min bi-weekly acc. Stand-ups (ongoing)",
        "Month 4",
        "Business case",
        "alignment",
        "We are here"
      ]
    },
    {
      "slide_number": 14,
      "text": [
        "Next steps ",
        "Feedback and sign off on this playback and discovery brief ",
        "Discovery research begins ",
        "1 hour discovery presentation – ",
        "26/09 – 11am-12pm",
        "3 hours DMU and VP workshop – 30/09 – 93:0am-12:30pm"
      ]
    },
    {
      "slide_number": 15,
      "text": [
        "Appendix",
        "Document and kick off interview analysis"
      ]
    },
    {
      "slide_number": 16,
      "text": [
        "To better understand DHL's strategic intentions and relationship with MSD, the following information would provide Magnus with a strong basis for valuable insight generation.",
        "Gaps in information",
        "Account research: Background information on ",
        "MSD",
        ", their strategic priorities, challenges and any other information that may impact DHL.",
        "Marketing/business/sales strategy: Past or present strategic direction that can outline where the business wants to go, and how it aims to get there.",
        "A better understanding of who: Key personas/DMU in ",
        "MSD that",
        " can facilitate conversations. A clearer perspective at an individual level of who they are, their needs – how can DHL address these needs?",
        "Content strategy: Any information regarding plans for content/tactics that aim to work towards the account objectives.",
        "Process mapping: Previous outlines of processes to 'win' accounts, any pain points, ways of working, conflict management etc., to be able to align both organisations. "
      ]
    },
    {
      "slide_number": 17,
      "text": [
        "Account history"
      ]
    },
    {
      "slide_number": 18,
      "text": [
        "Observations",
        "Historic losses/cancelled accounts: ",
        "This document outlines DHL' s 12 year history with MSD, with previous accounts lost due to scope, lack of proactivity/innovation, and customer relocation of project. These accounts were lost to ",
        "Kuehne + Nagel, TNT, and an unknown competitor (listed as a 3PL, DHL (?)). The most recent account loss (2024) comes from reasons out of DHL's control (Customer re location of operation), which sits DHL in a comfortable decision that had it not been for this, they may have won the contract, highlighting both MSD's willingness and DHL's readiness.",
        "New contacts: ",
        "This document outlines the extensive and broad list of MSD contacts, however, only one of these (Christine ",
        "Guillonneau",
        "- Head of Procurement Governance and Solutions, North) is an active decision-maker, calling out the clear need for DHL to focus their efforts on engaging with more decision-makers. Although there has been recent engagement with some contacts, of whom most fall into the relevant category (procurement), the majority of MSD contacts are unsubscribed from marketing emails, providing DHL with the challenge for re-engaging these relevant stakeholders.",
        "Open pipeline: ",
        "The document outlines positive conversation with an open lead regarding MSD's openness to moving away from ",
        "Alloga",
        ", with further conversations surrounding frozen pallet capacity, suggesting MSD's willingness and proactivity to work with DHL.  "
      ]
    },
    {
      "slide_number": 19,
      "text": []
    }
  ]
}