{
  "type": "pptx",
  "file": "Magnus Consulting_ DHL GT accelerator_ MSD_ CCC Intelligence Report.pptx",
  "slides": [
    {
      "slide_number": 1,
      "text": [
        "Commercial and Competitor Intelligence Report",
        "Golden Ticket Accelerator",
        "September 2025",
        "DHL and MSD"
      ]
    },
    {
      "slide_number": 2,
      "text": [
        "2",
        "Contents",
        "Sizing the market opportunity ",
        "(slides 4 - 7)",
        "Market view ",
        "(slides 8 - 15)",
        "Competitive landscape analysis ",
        "(slides 16 - 25)",
        "Recent news and updates – ",
        "C",
        "ompetitors and ",
        "MSD ",
        "(slides ",
        "26",
        " - ",
        "29",
        ")",
        "Next steps"
      ]
    },
    {
      "slide_number": 3,
      "text": [
        "Rising cost pressures and the need for efficiency mean ",
        "MSD is prioritising automation, AI, and digital tools as a core part of its investment strategy.",
        "This creates an opportunity for ",
        "DHL to ",
        "position themselves as a strategic partner ",
        "with a track record and the capabilities to enable this change.",
        "Competitors highlight flexibility, networks and automation, ",
        "but not the transformational outcomes these enable. ",
        "This gap allows DHL to ",
        "create a distinctive positioning",
        " ",
        "to MSD ",
        "by leading with growth, flexibility, resilience and ",
        "long-term, proven customer value.",
        "The importance of outcomes over capabilities",
        "For MSD, regulatory compliance is a key proof point in distributor value and trust due to its importance in the pharmaceutical sector.",
        "This creates strong alignment with DHL, who can help MSD scale credible, outcome-driven compliance across its supply chain – ",
        "a topic that many competitors are not emphasising in their positioning. ",
        "Regulatory compliance at the forefront ",
        "of",
        " MSD’s supply chain strategy",
        "3",
        "Overarching key",
        " takeaways",
        "Cost-efficiency through digital innovation"
      ]
    },
    {
      "slide_number": 4,
      "text": [
        "Market opportunity",
        "Sizing ",
        "th",
        "e market"
      ]
    },
    {
      "slide_number": 5,
      "text": [
        "Valued at",
        " $1.6tn globally in 2024 and forecast to reach over $2tn by 2030",
        ", the pharmaceutical market’s performance and growth are being",
        " shaped by innovation pipelines, regulatory scrutiny, sustainability demands, and digitalisation",
        "1,9",
        "5",
        "The key forces shaping pharma growth ",
        "Regulatory complexity",
        "Tightening global standards are increasing compliance costs and altering pricing structures, requiring ",
        "supply chains that are highly adaptable ",
        "and transparent.",
        "7,9",
        "Evolving partner expectations",
        "Pharma companies expect ",
        "logistics partners to deliver integrated solutions ",
        "that ensure end-to-end visibility, secure cold-chain integrity, sustainable operations, and digital maturity to support global distribution.",
        "4,8",
        "Innovation as a growth driver",
        "R&D investment exceeded $244bn in 2023 with biologics and cell & gene therapies now accounting for >35% of late-stage pipelines. ",
        "Logistics providers must adapt to specialist handling and cold-chain needs",
        ". ",
        "2,3",
        "1. ",
        "2.",
        "3. ",
        "https://hardmanandco.com/wp-content/uploads/2025/04/250403-Hardman-Co-Insight-2024-Pharma-Statistics.pdf",
        "https://www.biospace.com/biologics-market-size-to-hit-around-usd-1-37-trillion-by-2033",
        "https://www.gminsights.com/industry-analysis/biopharmaceutical-market",
        "https://www.emergenresearch.com/industry-report/biologics-market",
        "https://www.geneonline.com/key-trends-in-the-pharmaceutical-pipeline-for-2024-part-i-transformative-rd-growth-driven-by-breakthroughs-in-oncology-neurological-and-metabolic-therapies",
        "https://www.iqvia.com/insights/the-iqvia-institute/reports-and-publications/reports/global-trends-in-r-and-d-2024-activity-productivity-and-enablers",
        "https://web-assets.bcg.com/9b/75/1c0db8bf4ee5b159b1d732ab6f1e/focusing-on-innovation-amid-complexity-jan-2025.pdf",
        "https://www.mordorintelligence.com/industry-reports/pharmaceutical-manufacturing",
        "https://www.efpia.eu/media/2rxdkn43/the-pharmaceutical-industry-in-figures-2024.pdf"
      ]
    },
    {
      "slide_number": 6,
      "text": [
        "6",
        "MSD is reinforcing resilience and expanding global reach",
        "Prioritising reliable supply, strengthening partnerships, and investing in compliance.",
        "1. https://www.msd.com/stories/our-q4-and-full-year-2024-financial-results/?utm_source=chatgpt.com",
        "2. ",
        "https://www.bbc.co.uk/news/articles/ckgzyxjr0lzo",
        "Resilience: ",
        "Agile logistics are critical to prevent supply disruptions.",
        "Expansion:",
        " ",
        "Partnerships with logistics specialists broaden market access.",
        "Compliance:",
        " ",
        "Investment in warehousing and cold-chain ensures regulatory adherence.",
        "MSD are ",
        "delivering strong performance",
        ":",
        "However, despite this growth, MSD have scrapped plans to invest £1bn to expand its UK operations, due to lack of government investment within the sector.",
        "2",
        "2024",
        "£60bn global revenue",
        "1",
        "+6% YoY"
      ]
    },
    {
      "slide_number": 7,
      "text": [
        " “(The decision) reflects the challenges of the UK not making meaningful progress towards addressing the lack of investment in the life science industry and the overall undervaluation of innovative medicines and vaccines by successive UK government”",
        "- MSD, 2025",
        "https://",
        "www.bbc.co.uk",
        "/news/articles/ckgzyxjr0lzo",
        "Despite striving for technological innovation within the UK, increased regulation and pricing pressures, coupled with lack of government investment in the sector has led MSD to scrap plans to expand their UK operations. "
      ]
    },
    {
      "slide_number": 8,
      "text": [
        "Market view ",
        "Secondary Research"
      ]
    },
    {
      "slide_number": 9,
      "text": [
        "From AI-driven demand planning to digital control towers, ",
        "technology is now central to driving down unit costs and improving supply resilience.",
        "Logistics providers who able to ",
        "offer value through advanced digital capabilities will stand out ",
        "as being able to deliver the cost and service gains required by pharmaceutical firms.",
        "M&A activity across the sector is ",
        "creating larger, more competitive logistics players",
        ", giving MSD access to broader service portfolios but ",
        "intensifying competition for tenders.",
        "This heightens the need for providers to prove both scale and flexibility to win business, ",
        "stand out against newly enlarged rivals and secure MSD’s trust.",
        "Mergers & acquisitions are redefining competition",
        "Tightening compliance rules now require pharma firms to hold 6–10 weeks of stock in-country",
        ", creating £500m in extra warehousing demand.",
        "1",
        " ",
        "Logistics partners must be able to show how they can ",
        "deliver robust UK-compliance capabilities ",
        "to strengthen MSD’s supply resilience across both Human and Animal Health tenders",
        ".",
        "Rising regulation is reshaping logistics expectations",
        "9",
        "Market view: K",
        "ey",
        " takeaways",
        "Technology has become the backbone of efficiency & resilience ",
        "1. Pinsent Masons, 2025: https://",
        "www.pinsentmasons.com",
        "/out-law/news/medicines-supply-spot-audits-shortages-risk"
      ]
    },
    {
      "slide_number": 10,
      "text": [
        "UK’s VPAS rebate scheme forced pharma firms to return over 25% of sales in 2022 to the NHS, making cost efficiency non-negotiable ",
        "(",
        "Pharmaphorum, 2025",
        ") has forced companies to rebate an enormous percentage of sales back to the NHS, which has contributed to MDS’s decision to scale down some UK investments. ",
        "The selection of logistics partners is largely driven by procurement’s mandate to achieve service levels at the lowest total cost. (",
        "The Pharmacist, 2024",
        ")",
        "In a survey, 44% of pharma companies said they are focusing on AI-driven S&OP to enhance agility against market fluctuations and regulatory changes​ (",
        "sdcexec.com, 2024",
        "). ",
        "MSD has made automation (robotic picking, AI-driven demand planning) a central supply chain strategy to reduce unit distribution costs ",
        "( ",
        "Thadeusmed, 2024",
        "). ",
        "GXO’s £2bn NHS Supply Chain contract demonstrates its ability to deliver cost efficiencies at scale through automation and process optimisation (",
        "GXO, 2025",
        "), in an effort to improve its ‘antiquated technology’. The increased efficiencies will help save the NHS between £377-675 million before 2026, in turn helping to reduce the cost burden on pharma companies and their logistics partners. (",
        "National Audit Office, 2024",
        ")",
        "10",
        "NHS rebate clawbacks are squeezing pharma margins, ",
        "forcing procurement to prioritise lowest-cost logistics partners",
        " and accelerating demand for automation-led efficiencies.",
        "Market ",
        "View ",
        "1: Cost"
      ]
    },
    {
      "slide_number": 11,
      "text": [
        "11",
        "Digital innovation is essential in enabling efficiencies in pharma logistics, creating ",
        "opportunities for providers who can deliver technologically advanced solutions to differentiate and meet these demands.",
        "Market View",
        " ",
        "2",
        ": Digitisation",
        "From advanced tracking systems to artificial intelligence (AI), technology is revolutionizing the way pharmaceutical companies manage their supply chains",
        ", improving efficiency, accuracy, and compliance. (",
        "Bio Cair, 2025",
        ").",
        "MSD’s ",
        "Plant-to-Patient",
        " programme integrates IoT and predictive analytics to monitor temperature, location, and risk across shipments, demanding logistics partners who can plug into its global control tower (",
        "Thadeusmed, 2024",
        "). ",
        "They have invested in digital infrastructure and tools in the past five years; are are now focused on building and scaling an innovation engine that harnesses the power of data and digital to accelerate growth. (",
        "Nature, 2025",
        ")",
        "MSD emphasise a need to improve data visibility and control in its supply chain. Data fragmentation has also been cited as a pain point for MSD. Newer digital initiatives aim to solve by integrating 3PL data feeds and using cloud-based control tower dashboards, ensuring end-to-end visibility, helping increase efficiencies, communication and general quality oversight  (",
        "Supply Chain Digital, 2021; ",
        "(",
        "Verified Market Research, 2025",
        ")",
        "."
      ]
    },
    {
      "slide_number": 12,
      "text": [
        "12",
        "With both pharma companies and government initiatives driving net-zero commitments,",
        " sustainability is becoming a critical consideration in tender bids.",
        "Market view 3",
        ": ",
        "Sustainability",
        "One clear example of the influence of environmental sustainability in tendering is the Net Zero Supplier Roadmap from NHS England",
        ", that started in 2022 with the requirement that all NHS procurements needed to include a minimum 10% net zero and social value weighting (",
        "Cube RM, 2024",
        ").",
        "This is driving pharma firms to commit to net-zero targets (MSD targeting net-zero by 2045), requiring partners to demonstrate low-carbon warehousing, renewable energy use, and green transport in tender bids (",
        "Merck Sustainability, 2025",
        ").",
        "The NHS net zero supplier roadmap sets out the steps suppliers must take to align with the NHS net zero ambition through to 2030,",
        " with compliance to this a standard requirement for tender bids, making it imperative for pharma companies and their logistic partners to have both a carbon reduction plan and a net zero commitment, in order to have a chance of being considered in any NHS tender (",
        "NHS, 2023",
        ")."
      ]
    },
    {
      "slide_number": 13,
      "text": [
        "13",
        "Regulatory pressure and new trade barriers are forcing pharma to hold stock for longer, ",
        "driving £500m+ in additional warehousing demand - creating fresh opportunities for logistics providers.",
        "Market View",
        " 4: Regulation and compliance",
        "Increasing compliance demands require pharma companies to hold 6–10 weeks of stock in-country, creating £500m in additional warehousing demand ",
        "(",
        "Pinsent ",
        "Masons, 2025",
        "). ",
        "The post-Brexit shift from the EMA (Europe) to the MHRA (UK) regulatory body is still impacting pharma logistics, increasing trade barriers, subsequently demanding more in-country stockpiling as a  ‘just in case’.  To alleviate these bottlenecks pharmaceutical companies are diversifying their supply chains, reducing their reliance on a single source, reducing the risk of disruptions. (",
        "Global Vision, 2025",
        ")",
        "Furthermore, MSD operate in both Human Health and Animal Health markets, often with “dual-use” medicines that serve veterinary and human needs. This means that, although they have the same use, they follow different regulatory pathways, creating complex logistic inefficiencies. (",
        "EMA, 2025",
        ")"
      ]
    },
    {
      "slide_number": 14,
      "text": [
        "14",
        "M&A activity among pharma logistics providers is creating larger, more competitive players,",
        " ",
        "providing access to broader solutions but also increasing competition for DHL.",
        "Market view 5",
        ": ",
        "Market consolidation",
        "As the pharmaceutical logistics industry witnesses a wave of M&As, the competitive landscape is being redefined. These moves are not just about scale; they are about creating integrated, end-to-end, tailored solutions, increasing the scope of services available to pharmaceutical companies. ",
        "(Stat Times, 2025",
        ")",
        "This shift is also driving greater cost efficiency. “M&As often result in economies of scale,” enabling providers to lower per-unit costs and invest in advanced infrastructure. This, in turn, benefits pharmaceutical companies through “predictable pricing models,” which are crucial for handling high-cost, sensitive products. (",
        "Stat Times, 2025",
        ")",
        "Yusen’s €1.25bn acquisition of Movianto in 2025 created one of the UK’s largest healthcare logistics providers, with £202m in UK revenues ",
        "(",
        "Transport Intelligence, 2025",
        "). ",
        "Alliance Healthcare’s acquisition by AmerisourceBergen (",
        "Cencora",
        ") brought Alloga into one of the world’s largest pharma distribution groups (",
        "Pharmacy Magazine, 2021",
        ").",
        "These mergers, offer pharma companies reduced costs, greater agility, and greater control, as well as implementing standardised practices. However, this leaves pharma firm vulnerable to supplier dependency. (",
        "Cencora, 2021",
        "; ",
        "Supply Chain Wizard, 2025",
        ")"
      ]
    },
    {
      "slide_number": 15,
      "text": [
        "15",
        "MSD’s complex dual-market logistics model demands ",
        "supply chain solutions that ensure efficient delivery ",
        "to avoid disruptions that could damage customer satisfaction and competitiveness.",
        "Market view 6: Flexibility",
        "MSD operate in both the Human Health and Animal Health sectors, and although these tenders are different, logistic providers must demonstrate flexibility to compete for both. (",
        "Transvoyant, 2025",
        ")",
        "‘One Health’ refers to MSD’s collaborative, multisectoral, and multi-disciplinary approach that recognises the interconnection between people, animals and environment. MSD are uniquely positioned, with our human and animal health businesses both rooted in strong science, to help lead and guide discussions about One Health issues, ",
        "requiring stakeholders ‘",
        "to communicate, collaborate and coordinate",
        "’ (",
        "MSD One Health, 2021",
        "; ",
        "MSD Animal Health, 2025",
        ").",
        "The Animal Health business tends to be innovation-led and growth-focused, with new vaccines, veterinary pharmaceuticals, and even digital solutions for herd management coming to market. This means the Animal Health supply chain often needs flexibility to launch and distribute new products. (",
        "HealthforAnimals, 2023",
        ")",
        "Whereas the Human Health business requires reliability and precision, due to NHS expectations around medicine availability and timely delivery, shaping what MSD seek in a logistics partners to reduce the risk of disruptions, which impact patients (",
        "NHSE, 2025",
        ") which ultimately could impact MSD’s chances in an NHS tender bid."
      ]
    },
    {
      "slide_number": 16,
      "text": [
        "Competitor Landscape Analysis"
      ]
    },
    {
      "slide_number": 17,
      "text": [
        "While DHL actively links its solutions to stronger client outcomes, ",
        "competitors like ",
        "Alloga",
        ", GXO and ",
        "Movianto",
        " focus more on internal efficiencies. ",
        "DHL can differentiate by leading with customer-centric messaging",
        ", highlighting how your work can directly improve patient and business outcomes. ",
        "Regulatory expertise and experience used as proof points",
        "Alloga",
        ", GXO and Yusen include adherence to the highest quality and regulatory standards",
        " as a proof point to appeal to pharma clients",
        ", however this isn’t linked clearly to business outcomes.",
        "Focusing on reliability and compliance security across the value chain is ultimately a BAU aspect in pharma, not a differentiator.",
        "Customer-centric solutions remains underdeveloped in competitor positioning",
        "17",
        "Competitor landscape: Key",
        " takeaways",
        "Technological innovation has become an expectation, not a differentiator",
        "Competitors including GXO and Yusen highlight robotics, automation, and digital solutions as core to their healthcare logistics offerings.",
        "With technology now table stakes across the sector, ",
        "differentiation will come from positioning how these tools are applied to deliver measurable client outcomes",
        ", rather than from the technologies themselves."
      ]
    },
    {
      "slide_number": 18,
      "text": [
        "18",
        "The Competitive Landscape",
        "Competitors analysed in this section",
        "+"
      ]
    },
    {
      "slide_number": 19,
      "text": [
        "Audience benefit ladder",
        "Emotional benefit",
        "Transformational benefit",
        "Societal benefit",
        "Functional benefit",
        "Attributes",
        "How does it change society",
        "How does it change my life",
        "How does it it make me feel",
        "What do I get?",
        "Product USP / features",
        "Brand/",
        "buyer enablement",
        "Product and service messaging",
        "GTM value proposition",
        "Competitor",
        " positioning and messaging"
      ]
    },
    {
      "slide_number": 20,
      "text": [
        "While competitors focus on internal capabilities, DHL can differentiate by emphasising ",
        "what impact it delivers for the customer",
        ", turning expertise into transformational business outcomes.",
        "Competitor insight 1: Positioning",
        "Competitors focus on internal gains:",
        " Many logistics players highlight digitalisation primarily in terms of automation, route optimisation, or warehouse efficiency, ",
        "emphasising how it benefits operations rather than the value this brings to customers – the ‘so what’ aspect",
        ".",
        "Gap in addressing customer priorities:",
        " 70% of FMCG and pharma clients cite end-to-end visibility and predictive risk management as top priorities, yet competitor positioning rarely addresses these directly, leaving a clear expectation gap.",
        "Client-centric digitalisation is limited:",
        " Despite widespread investment in AI, IoT, and predictive analytics, ",
        "few competitors explicitly link these capabilities to outcomes ",
        "such as improved delivery visibility, proactive risk management, or greater supply chain agility.",
        "Opportunity for DHL differentiation:",
        " ",
        "DHL can position its digital investments around tangible client benefits",
        ",  e.g., enhanced real-time visibility, predictive service levels, and data-driven sustainability reporting, moving beyond operational efficiency to become a trusted partner in customers’ strategic digital transformation."
      ]
    },
    {
      "slide_number": 21,
      "text": [
        "21",
        "Top-level positioning of competitor adviser platforms",
        "Competitor Insight 1: Positioning - Context to support the insight",
        "Competitor",
        "Solution",
        "Positioning",
        "DHL",
        "Life Sciences and Pharma",
        "The scale and experience to implement healthcare logistics solutions across the world.",
        "Alloga (owned by Cencora)",
        "Logistics and warehousing",
        "Leverage our global network, specialized packaging, and customs expertise to ensure safe, secure storage and timely delivery worldwide.",
        "GXO",
        "Healthcare",
        "Technologically-advanced tailored healthcare logistics solutions.",
        "Movianto",
        "Homepage",
        "Movianto is a leading European supply chain solutions partner offering best-in-class quality for the pharmaceutical, biotech, medical device and diagnostic industries.",
        "Yusen Logistics",
        "Healthcare",
        "Ensure the safety and integrity of your medical and pharmaceutical cargo."
      ]
    },
    {
      "slide_number": 22,
      "text": [
        "22",
        "Competitor Insight 1: Positioning - Context to support the insight",
        "Top-level positioning of competitor adviser platforms"
      ]
    },
    {
      "slide_number": 23,
      "text": [
        "23",
        "Top-level positioning themes of competitor solutions",
        "Competitor Insight 1: Positioning - Context to support the insight",
        "Competitor",
        "Compliance",
        "Flexibility",
        "Efficiency",
        "Digital innovation",
        "Customer connection",
        "Sustainability",
        "Other",
        "DHL",
        "✓",
        "holding rigorous levels of quality and expanding our strategic global network of certified facilities.",
        "✓",
        "supply chains need to become more agile, flexible, resilient and collaborative to respond to faster product deployment",
        "✓",
        "We can help improve efficiencies and significantly impact the overall performance of a hospital or group",
        "✓",
        "Driving digitalisation and supply chain transformation",
        "✓",
        "customers are truly",
        "connected across the value chain through digitalisation",
        "Alloga (Cencora)",
        "✓",
        "adherence to the highest quality standards",
        "✓",
        "flexible account management",
        "✓",
        "our community-level insight helps us to deploy resources effectively and efficiently",
        "✓",
        "Increase access to medications with our innovative solutions and secure supply chain.",
        "✓",
        "continuously innovating to meet the needs of our customers",
        "✓",
        "plan for sustainable growth and create better health outcomes.",
        "GXO",
        "✓",
        "focus on process standardization, data accuracy, and regulatory compliance",
        "✓",
        "Flexible solutions that quickly adapt to supply chain changes",
        "✓",
        "improves consistency and ultimately enhances patient care and operational efficiency.",
        "✓",
        "Technologically-advanced tailored healthcare logistics solutions",
        "Movianto/",
        "Yusen Logistics",
        "✓",
        "delivered with full compliance",
        "✓",
        "supported by flexible IT architecture that fit your existing systems",
        "✓",
        "Proven results in optimizing supply chains",
        "Cost: cost, and complexity at every turn. We can help you work through those challenges.",
        "Transparent and open communication"
      ]
    },
    {
      "slide_number": 24,
      "text": [
        "Competitors strengthen their appeal to the pharma industry by emphasising their global regulatory expertise, and proven track record as core proof points.",
        "Competitor insight 2: Reasons to believe",
        "Alloga",
        " remains distribution-focused:",
        " While ",
        "Alloga",
        " is strong in pharmaceutical wholesale and pre-wholesaling, its positioning is concentrated on inventory and warehousing, leaving DHL space to differentiate with full end-to-end GDP-compliant cold chain capabilities.",
        "GXO highlights automation, not compliance:",
        " ",
        "GXO leads on robotics and automation within warehouses",
        ", but rarely links these capabilities to regulated pharma requirements, whereas DHL can demonstrate unmatched regulatory expertise and global GDP consistency.",
        "Yusen leans on network breadth:",
        " Yusen promotes its global forwarding and multimodal reach, ",
        "focusing primarily on its scale within the sector ",
        "e.g. “8,200 controlled drugs pallet spaces”",
        "DHL’s credibility is proven:",
        " By contrast, DHL combines global regulatory leadership, an extensive GDP-ready network, and a track record in vaccine and clinical trial distribution, providing tangible proof points competitors cannot match."
      ]
    },
    {
      "slide_number": 25,
      "text": [
        "25",
        "Reasons to believe ",
        "At an Adviser Platform solution level, reasons to believe were identified across respective competitor adviser platform solution pages. At a brand level, reasons to believe were identified on competitor homepages, ‘Why’ webpages and ‘About us’ webpages or relevant equivalent brand level webpages. ",
        "Competitor Insight ",
        "2",
        ": Reasons to believe - Context to support the insight",
        "DHL",
        "Alloga",
        "GXO",
        "Movianto/",
        "Yusen Logistics",
        "Expertise in: Pharmaceuticals, medical devices, clinical trials",
        "Deep expertise in storing and transporting at deep frozen, chilled and controlled ambient",
        "our unrivalled global capability, and healthcare and life sciences expertise will help you embrace new growth opportunities",
        "With over 120 sites in more than 40 countries, 8,000 dedicated healthcare staff including 150 full time pharmacists",
        "Global reach with local expertise",
        "We design and deliver solutions for unparalleled access, efficiency, and reliability to move health forward.",
        "GXO specializes in solutions designed for the complex needs of healthcare logistics, providing critical fulfillment and inventory management for hospital supplies, medical devices, and pharmaceuticals.",
        "99% on-time delivery performance",
        "(",
        "Movianto",
        ")",
        "Some of our amazing clients: Novo Nordisk,  Biotest etc..",
        "8,200 controlled drugs pallet spaces",
        "3,000+ client success stories",
        "20+ years flu vaccine campaign experience",
        "100% GDP certified",
        "Over 70 years of experience",
        "(Yusen)",
        "Yusen Logistics delivers the specialized healthcare logistics services required throughout your supply chain.",
        "Ensure the safety and integrity of your medical and pharmaceutical cargo.",
        "World’s leading contract logistics provider​",
        "​",
        "50+ countries in active operation ​",
        "​",
        "~1300 warehouses locations​",
        "​",
        "~39 million square meters of storage space​",
        "​",
        "~188,000 supply chain experts",
        "Cencora",
        " is a leading pharmaceutical solutions organization centered on improving the lives of people and animals everywhere.",
        "We're partner-centric, purpose driven, accelerate patient outcomes and enhance global access.",
        "a presence in over 50 countries",
        "$290 billion + annual revenue",
        "51,000 team members",
        "10 on Fortune 500",
        "AA MSCI ESG Rating, top among industry peers​",
        "​",
        "Top Supply chain projects award (2022,23,24)​",
        "​​​",
        "Game-changing innovation and automation​",
        "​",
        "Who are we: Logistics experts​",
        "​",
        "Scale: ~1000 warehouse locations, ~15k team members, 27 countries, ~200m sq.ft warehouse space, `~30% Fortune 100 companies are customers, $11.7billion revenue (2024)​",
        "​",
        "Results: 4-6x productivity improvement, 5x more items shipping using robotic automation, 5-7% average labour efficiency improvement ​",
        "​",
        "GXO is on track to meet or exceed our ESG goals…",
        "(",
        "Movianto",
        ")",
        "Movianto",
        " is a leading European supply chain solutions partner offering best-in-class quality for the pharmaceutical, biotech, medical device and diagnostic industries.",
        "(Yusen)",
        "Delivering world-class service everywhere",
        "We operate more than 748 distribution centers/offices in 437 cities in 46 countries and regions. ",
        "At a healthcare  logistics solution level",
        "At a brand level",
        "KEY:",
        "Awards & recognition",
        "Expertise ",
        "Proof points"
      ]
    },
    {
      "slide_number": 26,
      "text": [
        "Competitors and MSD",
        "Recent news and updates"
      ]
    },
    {
      "slide_number": 27,
      "text": [
        "27",
        "Competitor news highlights the increasingly competitive market, with firms utilising technology, innovation and acquisitions to substantiate their position. ",
        "Recent competitor and MSD news",
        "Blow for UK drugs sector as Merck scraps £1bn expansion (",
        "BBC, Sep 2025",
        ")",
        "The decision \"reflects the challenges of the UK not making meaningful progress towards addressing the lack of investment in the life science industry and the overall undervaluation of innovative medicines and vaccines by successive UK governments",
        "Movianto has developed European solution for logistics in the ultra-deep-freeze sector (",
        "Business Focus, Sep 2025",
        ")",
        "Movianto has established a European network for ultra-low temperature storage at down to minus 80° Celsius.",
        "Cencora & The Lash Group $40M Data Breach Settlement (",
        "Claim Depot, Sep 2025",
        ")",
        "Cencora Inc. and The Lash Group LLC have agreed to pay $40,000,000 to settle a class action lawsuit for alleged failures to protect personal information, which resulted in a data breach which compromised the personal and protected health information of individuals across the United States and its territories.",
        "NYK Group Commits to Acquire Walden’s European Healthcare Logistics Business (",
        "Logistics Manager, Sep 2025",
        ")",
        "The acquisition is being led by Yusen Logistics (Europe) B.V., an overseas subsidiary of Yusen Logistics Group, and is currently pending regulatory clearances and the finalization of a Share Purchase Agreement.",
        "Yusen acquires Movianto for €1.25bn (",
        "Multimodal, July 2025)",
        "Yusen Logistics has committed to acquire the healthcare logistics business of the Walden Group through the acquisition of the entire share capital of Movianto International by entering into a Put Option Agreement with Walden Group International.",
        "GXO awarded US$2.5bn multi-year contract with NHS Supply Chain (",
        "Logistics Manager, May 2025",
        ")",
        "This landmark agreement with the NHS in England will serve as a springboard to further grow our healthcare footprint in the UK, as well as in the US and Europe as more healthcare organisations and suppliers recognise the benefits of a trusted logistics partner and a tech-enabled supply chain"
      ]
    },
    {
      "slide_number": 28,
      "text": [
        "28",
        "Next steps",
        "DHL to provide thoughts and feedback ",
        "Value proposition and DMU mapping workshop – 29/09 ",
        "Value proposition creation -15/10"
      ]
    },
    {
      "slide_number": 29,
      "text": []
    }
  ]
}