{
  "type": "docx",
  "file": "MSD VP Workshop Summary.docx",
  "paragraphs": [
    "DHL Golden Ticket - MSD: Workshop Summary",
    "Exploring the voice of the customer – key themes:",
    "Your voice of the customer headlines ",
    "Key themes ",
    "DHL will push our business forward with better service, clear understanding of requirements, and pricing that unlocks value. – CPO",
    "DHL has strengthened our life sciences capability by showing the value of managing animal and human supply chains together. – Head of Commercial supply chain",
    "DHL adds huge value by managing end-to-end supply chains under one provider. – Global supply chain",
    "At DHL, sustainable and digital solutions translate into action, directly linked to our initiatives. – Head of Commercial/ global supply chain",
    "We underestimated DHL’s potential before—now we see them as a cutting-edge partner able to bring ideas to life. – C-level",
    "DHL leads with digital capabilities, proven with other customers and ready to deliver for us. – Procurement/ Commercial",
    "DHL understands our ambitions and provides the expertise to deliver the right solutions. – Operations/ Data",
    "DHL helps us innovate at every level—we trust their data and strategy to shape the best solutions. – Operations/ Data",
    "DHL optimises end-to-end processes and ensures our strategy aligns with wider business needs. – Operations/ Data",
    "DHL combines high quality with supply chain resilience and sustainability for long-term growth. – SC director/ Commercial director",
    "DHL is a resilient, trusted partner with strong sector expertise—customers feel the benefit and we gain value. – C-suite/ Ops",
    "DHL delivers against expectations, boosting supply chain strength, customer efficiency, and satisfaction. – Head of SC",
    "DHL’s digitalisation and automation examples show real potential to drive change and impact. – CEO",
    "Deep partnership and trust​",
    "Consolidation",
    "End-to-end supply chain​",
    "Sustainability and digital – showing proven impact​",
    "Strategic alignment and ambition​",
    "Proven expertise",
    "Leading technical solutions​",
    "Value creation​",
    "Co-creation and wider impact​",
    "Resilience (cyber specifically) and future growth​",
    "Internal alignment and reliability​",
    "Agility and responsiveness​",
    "Efficiency and cost focus​",
    "Innovation in life sciences​",
    "Trust and familiarity ",
    "Defining the decision-making unit:",
    "Decisions makers: ",
    "Head of commercial channels, Commercial Ops director, CEO, SC lead, Head of Logistics, Operations Director",
    "Wider influencers:",
    "CFO, Board, CTO, Compliance Lead ",
    "Wider community: ",
    "Sustainability lead, Integrated logistics procurement, Customer service manager, ",
    "Three confirmed audience groups with key priorities and themes:",
    "THEMES",
    "CEO/MD",
    "Commercial Ops Director/Head of Commercial Trade Channel ",
    "Supply Chain Lead/Head of Logistics/Ops Director",
    "TOP 3 PRIORITIES",
    "Growth vision: realise strategic ambitions ",
    "Product availability: ensure resilience and reliability ",
    "Customer expectations: meet sustainability and experience goals ",
    "Business growth: quantify value of offering and ROI ",
    "Financial focus: cost-to serve, KPIs, long-term strategy ",
    "Innovation & value streams: unlock hidden opportunities ",
    "Total visibility: across supply chain with real-time data ",
    "Operational excellence: meet SLAs and compliance ",
    "Resilient supply: sustainable, agile and crisis-ready",
    "ALL OTHER THEMES",
    "Strengthen partnerships with trusted providers ",
    "Assurance on resilience and recovery from crises ",
    "Confidence in future investment and reliability ",
    "Scenario modelling for strategy validation ",
    "Commercial alignment (capex/ investment fit) ",
    "Visibility of trends/ data to enable decision making ",
    "Operational performance delivered consistently ",
    "Piece innovation in OMS, safety & quality systems ",
    "Net zero warehousing & sustainable transport ",
    "Proactive issue management and cost efficiencies ",
    "Faster speed to market with brand/ customer trust  ",
    "Defining our points of difference that matter:",
    "Global strength, local focus – A truly international network with local expertise delivers scalable end-to-end logistics tailored to local needs, with independent partner positioning that protects neutrality.",
    "Proof through performance – Industry-leading NPS, MHRA compliance, and WELL/BREEAM accreditations, underpinned by data-led outcomes that evidence quality and impact.",
    "Innovation in action – 7,500+ robots and tools like Logic embed automation and digital continuity into operations, improving efficiency, resilience, and decision speed.",
    "Sustainability as standard – Net zero by 2050, sustainable warehousing, and strong EcoVadis ratings, supported by a clear life-sciences sustainability roadmap.",
    "Trusted partnerships – Deep, proven relationships with GSK, AstraZeneca, MSD and others position us as a strategic sector partner.",
    "Resilience you can rely on – Cyber strength, continuity planning, and proactive risk management keep supply chains moving, with continuous improvement from embedded internal experts.",
    "Breadth with depth – From I2M clinical logistics to last-mile delivery, integrated capabilities across the full value chain enable seamless global solutions.",
    "Recognised leadership – Independent recognition, including Gartner leadership placement and sector board representation, confirms our market-leading position.",
    "People-powered excellence – Accredited as a great place to work; ongoing HR investment and supportive environments foster top talent and a customer-first culture.",
    "Strategic transformation partner – Beyond logistics, we design, build, and deliver long-term, data-driven solutions aligned to customers’ growth strategies and evolving ambitions.",
    "Summary of key areas identified for exploration in the value proposition:",
    "Elevate partnership impact by consolidating global and local supply chain services into a single strategic model that delivers measurable value, supported by people excellence and a customer-first culture.",
    "Harness digital innovation through automation, continuity tools and data-led models that optimise MSD’s supply chains for greater visibility, efficiency, and control.",
    "Embed sustainability as a differentiator with net-zero warehousing, low-carbon transport, and advanced ESG reporting that accelerate MSD’s environmental goals and strengthen brand credibility.",
    "Demonstrate life sciences leadership by combining deep sector expertise, regulatory compliance, and independence from wholesalers to deliver tailored solutions that align with MSD’s growth strategy.",
    "Build resilience and agility by embedding cyber security, continuity planning, and proactive risk management to protect MSD’s operations and ensure readiness in a crisis.",
    "Unlock transformation through co-creation by aligning on long-term ambitions and co-developing solutions that drive competitiveness, innovation, and future-focused change."
  ]
}