{
  "type": "pptx",
  "file": "DHL GT Accelerator_Alignment WS Deck_Saint Gobain.pptx",
  "slides": [
    {
      "slide_number": 1,
      "text": [
        "DHL",
        ": Golden Ticket Growth Accelerator",
        "Saint-Gobain Playback"
      ]
    },
    {
      "slide_number": 2,
      "text": [
        "What’s included",
        "Current state",
        "DHL x Saint ",
        "Gobain",
        " ambition ",
        "Objectives to achieve ambition",
        "Success signals",
        "Account readiness analysis (current documents)",
        "Market discovery brief",
        "Next steps",
        "Appendix – Account & document analysis"
      ]
    },
    {
      "slide_number": 3,
      "text": [
        "Diagnosing the current state",
        "Account context",
        "Saint-Gobain (SG) has a close incumbent relationship with GXO, who operate the Wakefield NDC ",
        "(GXO recently taken over existing site)",
        "SG running a logistics forum (Sept) with current and potential providers, including DHL.",
        "SG is defining a 10-year logistics transformation vision.",
        "No immediate RFI/RFP - procurement expected late next year – currently in partner exploration phase.",
        "Actively assessing distribution network development (Potential southern DC alongside Wakefield). In short term – dropping into existing facility.",
        "Key challenges",
        "Historic relationship with SG through transport was transactional ",
        "Risk of being treated as one of several providers rather than a strategic partner – GXO, CEVA, DHL and 1 other",
        "GXO’s embedded position ",
        "may limit DHL’s ability to gain traction.",
        "Lack of clarity on Saint-Gobain’s transformation agenda and exact scope of opportunity.",
        "Current engagement procurement led - limited access to decision maker",
        "SG seeking input without commitment - “free consultancy”.",
        "Knowledge gaps",
        "Current state of their supply chain, strategic priorities and business unit integration needs.",
        "Depth and nature of the existing GXO relationship, or health/strength of this.",
        "Understanding of the 3–4 key stakeholders driving transformation (Jag Gill – Supply Chain Director, Head of Business Transformation; Brian Fisher – Head of Distribution; Stuart Saunders – Procurement).",
        "Why the account dropped out of DHL’s CSI/GAM frameworks and whether any negative perceptions exist globally.",
        "How open they are to res deal for Southern DC and DHL capability here ",
        "(compared to drop to existing site)",
        "Scenario 1 – the DC topic – what is the brief/title/focus here",
        "Why 2027 is such a key date (new DCs)",
        "Who is the SG board level sponsor (who is driving this transformation)",
        "One partner for whole NDC/CD or split due to risk/business continuity",
        "Who is the final 4",
        "th",
        " competitor?"
      ]
    },
    {
      "slide_number": 4,
      "text": [
        "4",
        "DHLs ambition for Saint ",
        "Gobain",
        " (long term)",
        "Established ",
        "DHL as Saint-Gobain’s flagship LLP partner, shaping their 10-year logistics transformation",
        "How we get there:",
        "Anchor DHL as Saint-Gobain’s LLP transformation partner, displacing GXO",
        "Shape and deliver the 10-year logistics vision - driving efficiency, predictability (visibility) and innovation.",
        "Build direct engagement beyond procurement and demonstrated near-term value"
      ]
    },
    {
      "slide_number": 5,
      "text": [
        "Objectives to deliver the ambition",
        "Accelerator objective ",
        "(short term)",
        "Reposition DHL to lead Saint-Gobain’s transformation as the trusted LLP partner - proving value beyond procurement, differentiating from GXO, and unlocking early proof points to a £100m+ partnership",
        "Value to DHL",
        "£80–100m revenue potential, £2m+ EBIT.",
        "Stretch of up to £150M revenue.",
        "Multi-year, multi-business-unit LLP opportunity.",
        "£120M Transport opportunity.",
        "DC, property ",
        "opps",
        ", network control, predictability across DHL.",
        "Potential to expand beyond UK into European/global scope (previously CSI/GAM).",
        "Chance to displace GXO (Northern DC) and secure a flagship building materials account.",
        "Near-term priorities",
        "Strengthen DHL in the account – move beyond procurement and build credibility with transformation leaders ",
        "(Jag - Business Transformation & Brian (Head of Distribution)",
        "Shape Saint-Gobain’s transformation agenda – secure clarity on 10-year priorities and influence scope ahead of RFP (end of 2026). ",
        "DCs live July 2027. Transport start 2028.",
        "Demonstrate LLP differentiation – prove DHL’s superiority to full competitor set (3 competitors) - ",
        "emphasising",
        " neutrality, predictability and integration.",
        "Unlock traction through early proof points - Southern DC is a likely near-time opportunity",
        "Reinforce DHL’s capabilities across urban logistics and sustainability (zero emission final mile) to build credibility in briefed scenario."
      ]
    },
    {
      "slide_number": 6,
      "text": [
        "Success signals - how we know we’re on track",
        "Success Signals",
        "Evidence",
        "Direct engagement with transformation leaders secured",
        "DHL moves beyond procurement-only access, building ",
        "active dialogue ",
        "with supply chain and transformation leaders (e.g. Jag Gill, Brian Fisher).",
        "Transformation agenda shaped and aligned",
        "Saint-Gobain’s 10-year logistics priorities and integration needs are clearly ",
        "articulated and validated ",
        "with DHL’s input.",
        "LLP value story tested and resonating",
        "DHL’s LLP proposition is ",
        "reflected back ",
        "by stakeholders as a fit for their transformation vision, differentiating from transactional suppliers.",
        "Clear differentiation from competitor landscape established",
        "DHL introduces core value proposition and proof points that stakeholders recognise as ",
        "distinct from GXO, CEVA, one other. ",
        "Commercial intent aligned and DHL’s value model validated",
        "Saint-Gobain acknowledges DHL’s commercial framework as ",
        "viable and competitive",
        ", creating confidence that DHL can deliver a sustainable multi-year partnership.",
        "Forum used to elevate positioning",
        "DHL participates in the logistics forum to ",
        "move beyond procurement",
        " and open dialogue with transformation leaders.",
        "Near-term proof point opened (e.g. Southern DC)",
        "DHL is invited to ",
        "jointly ",
        "co-design or shape ",
        "an ",
        "immediate initiative such as the Southern DC, demonstrating practical traction.",
        "Golden Ticket mobilisation visible",
        "DHL’s cross-functional account team is ",
        "visibly activated ",
        "under the Golden Ticket framework, with resources aligned to Saint-Gobain.",
        "Urban logistics credibility established",
        "DHL becomes recognised as a partner that can deliver sustainable, cost-effective, high-service ",
        "final mile solutions in urban areas",
        "."
      ]
    },
    {
      "slide_number": 7,
      "text": [
        "Account readiness ",
        "and market discovery "
      ]
    },
    {
      "slide_number": 8,
      "text": [
        "8",
        "Account analysis - key takeaways ",
        "1. Broaden engagement to build trust ",
        "Limited visibility of Saint-Gobain’s transformation needs and priorities creates an opportunity for DHL to engage in further market research and relationship-based discovery to ",
        "understand SG’s transformation roadmap ",
        "and where DHL fits in this. ",
        "By aligning DHL’s LLP strengths to the 10-year agenda, through an account focused value proposition, DHL can ",
        "demonstrate relevance and establish itself as a partner in shaping long-term success.",
        "Engagement to date has been led primarily through procurement, creating ",
        "a strong baseline for DHL to broaden the stakeholder landscape with further transformation and supply chain leaders.",
        "Mapping and engaging the wider decision-making unit and key stakeholders will be essential ",
        "to build trusted relationships and influence Saint-Gobain’s 10-year logistics vision.",
        "2. Shape the transformation agenda together",
        "3. ",
        "Establish credible distinction from GXO",
        "With GXO embedded, Saint-Gobain is seeking evidence of who can deliver greater ",
        "innovation, predictability, and integration. ",
        "DHL has the chance to prove its value through tangible proof points and case studies, ",
        "leaning on its experience to build credibility",
        " as the partner best positioned to deliver their long-term logistics transformation."
      ]
    },
    {
      "slide_number": 9,
      "text": [
        "Account Readiness Scorecard",
        "Account readiness scorecard",
        "Area",
        "Create",
        "Improve",
        "Validate",
        "Comments",
        "Account strategy and plan",
        "An account strategy or plan has not currently been created, however we have access to the ML October 2024 Strategy. ",
        "DHL global account plan to be shared",
        "Value proposition and messaging",
        "An account focused value proposition has not been created to date.",
        "Stakeholder map",
        "45 stakeholders have been mapped but many of these have either not been recorded as engaged or last sign of life was more than a year ago. We need to validate whether this is the most up to date stakeholder list and identify which are the key relationships for DHL to focus on. ",
        "DMU map",
        "Although there are no account specific personas, we do have access to the DHL needs based personas at brand level. ",
        "Competitor landscape",
        "Competitor research exists at brand level but we need to clearly establish what this means for DHL positioning with Saint ",
        "Gobain",
        ".",
        "Customer journey and pain points",
        "A clear customer journey map does not exist but DHL do have a good understanding of the pain points this account is facing (interview & research). ",
        "Win/loss insights and learning",
        "Win/loss records have been recorded - this ensures we can include these learnings into our approach moving forward. ",
        "Objectives and targets",
        "Although they do not exist in any documentation, there is a clear ambition and set of objectives that DHL wish to achieve for this account.",
        "Data foundation",
        "There is a good base level of data (research, win/loss etc.) that exists for this account – this will grow as we learn more about this account.",
        "*All files shared in the Saint ",
        "Gobain",
        " Golden Ticket account folder, and after the kick off call have been ",
        "analysed"
      ]
    },
    {
      "slide_number": 10,
      "text": [
        "Growth accelerators – added throughout process",
        "Growth accelerators",
        "Goal",
        "Hypothesis",
        "KPI / Success Metric",
        "Action Plan (next 4-6 wks)",
        "Priority Score",
        "Accountable",
        "Map & engage transformation leaders (beyond procurement)",
        "If we identify and open direct dialogue with the top 3-4 supply-chain & transformation decision-makers, DHL will rebuild trust and influence the 10-year agenda.",
        "# of new senior contacts - # of two-way meetings held",
        "Workshop to map key stakeholders",
        "Creation/validation of contact list",
        "1",
        "Magnus",
        "Co-create Saint-Gobain’s 10-year logistics roadmap",
        "If we create and present a draft roadmap, Saint-Gobain will see DHL as a strategic LLP partner and invite us to scope the RFP.",
        "Roadmap endorsed by client - DHL included in pre-RFP working sessions",
        "Discovery research to understand plan, pain points, priorities",
        "Draft roadmap creation",
        "Presentation and co-creation/adaption of roadmap",
        "2",
        "Magnus / DHL",
        "Craft an account-focused LLP value proposition",
        "If we tailor messaging to Saint-Gobain’s priorities (innovation, predictability, integration), engagement rates and meeting conversions will rise.",
        "Stakeholder ‘message resonance’ feedback• New meetings booked post-campaign",
        "VP workshop ",
        "Creation of account focused value proposition ",
        "1",
        "Magnus",
        "Innovation use cases to evidence LLP superiority vs GXO",
        "If we show where we have delivered measurable gains for customers related to LLP previously, stakeholders will recognise DHL’s value and capability.",
        "engagement - Positive feedback",
        "Identify case studies with the highest level of relevance to LLP",
        "Identify where they should be ",
        "implemeted",
        " in GTM/account strategy ",
        "Share with key stakeholders r Saint ",
        "Gobain",
        "2",
        "Magnus / DHL"
      ]
    },
    {
      "slide_number": 11,
      "text": [
        "11",
        "Market Discovery Brief",
        "The Market",
        "Saint-Gobain corporate strategy and priorities (sustainability, digital, growth areas)",
        "Supply chain/logistics challenges reported in public sources (e.g. integration, costs, resilience)",
        "Announcements on new sites, distribution centres or capital investment projects",
        "Leadership changes, executive interviews or quoted priorities",
        "News on partnerships, supply chain collaborations, or technology adoption",
        "Logistics and supply chain trends in building materials & construction sector",
        "Sector priorities: sustainability, resilience, cost control, digitalisation",
        "Distribution network developments (regional DCs etc.)",
        "Macro factors impacting construction supply chains (energy costs, labour shortages, regulation)",
        "The Account",
        "Competitors",
        "Top level positioning and analysis of the top 3 competitors competing for the account, including: GXO/Wincanton, CEVA (one other)",
        "Reasons to believe and public proof points (e.g. case studies, awards, accreditations, sustainability commitments)",
        "Accreditations, awards and published proof points (e.g. digital capabilities, green logistics)",
        "Recent competitor news: facility openings, acquisitions, or strategic partnerships"
      ]
    },
    {
      "slide_number": 12,
      "text": [
        "Timeline and next steps"
      ]
    },
    {
      "slide_number": 13,
      "text": [
        "Golden ticket project",
        " flow",
        "Kick off",
        "Brief & docs supplied",
        "Diagnose – Audits & gap analysis",
        "Design – CCC, DMU's & VPs",
        "Week 0",
        "Week 1",
        "Week 2",
        "Week 3",
        "Week 4",
        "Week 5",
        "Week 6",
        "Week 7",
        "Indicative timeline is achievable if we can ensure access to the key stakeholders as is required throughout.",
        "Alignment ",
        "Workshop",
        "Feedback",
        "Discovery presentation",
        "DMU / VP Workshop",
        "DMU / VP Presentation & review call",
        "Build – Persona, messaging themes, personalised content",
        "Persona",
        "Definition workshop",
        "GT Acct & Content",
        "Planning",
        "Outreach sessions 1 & 2",
        "Week 8",
        "Week 9",
        "Week 10",
        "Week 11",
        "Week 12-14",
        "Week 14-16",
        "Week 17-18",
        "Week 19-20",
        "Activiate",
        " – Launch GT account campaigns & monitor",
        "GT Acct kick off",
        "Training session - TBC",
        "Monthly performance review",
        "Monthly performance review (ongoing)",
        "Discovery ",
        "session",
        "30 min bi-weekly acc. Stand-ups (ongoing)",
        "Month 4",
        "Business case",
        "alignment",
        "We are here"
      ]
    },
    {
      "slide_number": 14,
      "text": [
        "Next steps ",
        "Feedback and sign off on this playback and discovery brief ",
        "Discovery research begins ",
        "1 hour discovery presentation – 18",
        "th",
        " or 19",
        "th",
        " September @ Time TBC",
        "3 hours DMU and VP workshop – 22",
        "nd",
        " or 24",
        "th",
        " September @ Time TBC - ",
        "in-person"
      ]
    },
    {
      "slide_number": 15,
      "text": [
        "Appendix",
        "Document and kick off interview analysis"
      ]
    },
    {
      "slide_number": 16,
      "text": [
        "To better understand DHL's strategic intentions and relationship with Saint ",
        "Gobain",
        ", the following information would provide Magnus with a strong basis for valuable insight generation.",
        "Gaps in information",
        "Account research: Background information on Saint ",
        "Gobain",
        ", their strategic priorities, challenges and any other information that may impact DHL.",
        "Marketing/business/sales strategy: Past or present strategic direction that can outline where the business wants to go, and how it aims to get there.",
        "A better understanding of who: Key personas/DMU in SG that can facilitate conversations. A clearer perspective at an individual level of who they are, their needs – how can DHL address these needs?",
        "Content strategy: Any information regarding plans for content/tactics that aim to work towards the account objectives.",
        "Process mapping: Previous outlines of processes to 'win' accounts, any pain points, ways of working, conflict management etc., to be able to align both organisations. "
      ]
    },
    {
      "slide_number": 17,
      "text": [
        "Account research"
      ]
    },
    {
      "slide_number": 18,
      "text": [
        "Observations",
        "Previous partnership challenges: ",
        "Previous friction between DHL and SG, with issues regarding safety (one of SG's core values) and fractious IT systems from SG's perspective, and poor communication from DHL's perspective . ",
        "Other notable issues SG state was DHL's lack of flexibility and ageing infrastructure, however, positively both companies now have a forward-facing outlook. ",
        "Objectives: ",
        "Saint-Gobain’s primary objective is to maximise production uptime by eliminating supply-chain bottlenecks and enabling seamless flow of goods across business units. ",
        "DHL is well positioned to support this goal by delivering predictable, integrated, and flexible solutions, leveraging innovation and operational excellence. ",
        "The focus should be on collaborative problem-solving and transparent performance management to rebuild trust, enhance supply-chain agility, and align logistics capabilities with SG’s long-term transformation vision.",
        "CSI Feedback: ",
        "SG’s decentralised, country-level decision-making structure currently prevents DHL from being incorporated into their CSI framework, despite DHL’s significant global presence and contribution as one of SG’s largest logistics partners outside CSI. ",
        "This structural limitation underscores the need for DHL to demonstrate value locally while building credibility regionally and globally, ensuring alignment with SG’s decision-makers at multiple levels and reinforcing DHL’s role as a strategic partner rather than a transactional provider"
      ]
    },
    {
      "slide_number": 19,
      "text": [
        "Account history"
      ]
    },
    {
      "slide_number": 20,
      "text": [
        "Observations",
        "Historic losses/cancelled accounts: ",
        "There is a history of numerous cancelled/lost accounts between DHL and SG. Reasons for this are competitiveness with regards to cost, insufficient logistics, IT systems, and poor communication. ",
        "Consequently, a lot of SG's logistics went in-house, however, 2 of DHL's major competitors CEVA and XPO Logistics gained these accounts as a result of DHL's lack of 'competitiveness’. ",
        "A key challenge or DHL now is competing against these companies, particularly XPO whom have a strong partnership with SG and warehouse operations.",
        "New contacts: ",
        "This document outlines that many of DHL's 'new' contacts are inactive, unsubscribed from marketing or over 2 years old (last sign of life). ",
        "This outlines DHL's need for lead generation for SG, especially among decision-making stakeholders, with majority of engagement currently led via procurement.",
        "Open pipeline: ",
        "This document outline that SG are exploring a 3PL / 4PL partner to enable the next stage of their growth journey for the next 10+ years, with an opportunity for DHL to offer transport, warehousing , and control tower services relating to construction materials, providing DHL with a large long-term opportunity. ",
        "However, the documents doesn’t outline any short-term strategy of how DHL can help SG get them to where they want to be within the next decade. "
      ]
    },
    {
      "slide_number": 21,
      "text": []
    }
  ]
}