{
  "type": "docx",
  "file": "Magnus Consulting_DHL Saint Gobain_VP and DMU Workshop Summary.docx",
  "paragraphs": [
    "DHL Golden Ticket - Saint-Gobain: Workshop Summary",
    "Exploring the voice of the customer – key themes:",
    "Voice of the customer headlines ",
    "Key themes ",
    "DHL show what sustainable, cost-efficient logistics could look like for Saint-Gobain. – COO",
    "DHL have taken time to deeply understand our supply chain and where we can improve. – Supply chain lead",
    "I see a different side of DHL: forward-thinking, strategic, and ahead of the curve in solutions. – Operations director",
    "We knew DHL were the largest, but their fresh, outside-the-box engagement shows true thought leadership. – Strategic lead",
    "DHL are the only provider we need, delivering value at every touchpoint as a true strategic partner. – Supply chain lead",
    "DHL solutions have transformed our supply chain and enabled us to achieve sustainability targets ahead of schedule. – CEO, Supply chain lead",
    "DHL are the partner of choice to unlock our strategic goals, having listened, understood, and demonstrated real solutions. – CEO",
    "DHL have shown capability to be our strategic partner, supporting growth, sustainability, and innovation agendas simultaneously. – CEO",
    "Cost ",
    "Sustainability ",
    "Expertise ",
    "Partnership",
    "Collaboration ",
    "Customer focus ",
    "Strategic partner ",
    "Innovative ",
    "Forward thinking",
    "Thought leader ",
    "Scale ",
    "Transformation",
    "Value ",
    "Defining the decision making unit:",
    "Decisions makers: ",
    "Head of Business transformation, MD (BU), Supply Chain Director, Head of Logistics & transport ",
    "Wider influencers:",
    "CEO, CFO, Board Group (FR)",
    "Wider community: ",
    "Sustainability lead, CTO/Digi Head, Procurement lead, Operations Manager, Operations Director, Head of Legal",
    "Three confirmed audience groups with key priorities and themes:",
    "THEMES",
    "Head of Business transformation",
    "MD (BU)",
    "Supply Chain director  ",
    "TOP 3 PRIORITIES",
    "Sustainability, growth and digitalisation: bring the strategy to life",
    "Deliver growth efficiently: simplify and consolidate to remove inefficiencies",
    "Future-proof operations: prepare for regulatory change and remain efficient",
    "Reliable customer service: on time and in full for end customers",
    "Financial targets: deliver group and business P&L goals",
    "Trusted logistics partner: outsource risk, ‘don’t need to think about logistics’",
    "Future-proofed solutions: think ahead to avoid pressure in the supply chain",
    "Fit-for-purpose supply chain: aligned to growth ambition and sustainability",
    "Visibility and control: data and openness that gives end-to-end oversight",
    "ALL OTHER THEMES",
    "Portfolio improvement with competitive products and solutions that meet regulation",
    "Innovation and digitalisation, driving transformation with new tech",
    "Expectation setting with realistic transformation agendas",
    "Support and guidance with clarity on what transformation should be",
    "Health & safety with zero accidents and safety-first culture",
    "Change enablement with shifts delivered at the right pace",
    "Incremental improvement, a ‘hop, skip and jump’ approach to transformation",
    "Greater influence with peers, by being proactive and meeting future expectations",
    "Confidence sustainability targets will be achieved",
    "Strong culture across supply chain with consistent ways of working",
    "Defining our points of difference that matter:",
    "Transformation leadership – proven ability to deliver true change agendas (easyJet, Mars, NUMS), shifting perception and unlocking measurable growth.",
    "Cross-sector expertise – applying logistics mindset and solutions across complex, hard-to-change industries, transferring learnings where precision and security matter.",
    "Sustainability at the core – embedded into every solution with zero-carbon warehousing, low-emission transport, and advanced reporting to accelerate progress to net zero.",
    "One DHL, end-to-end – global scale with local focus, integrating freight, trucking, forwarding and parcels to deliver seamless, visible solutions.",
    "Commercial rigour – upfront and transparent on cost efficiency, insulating against inflationary pressures and strengthening financial confidence.",
    "Confidence to challenge – not just answering the brief but proposing bigger, future-proof solutions that meet transformation and growth ambitions.",
    "Redefining delivery – By applying transformation agendas for customers like easyJet, NUMS, and Mars, we shift perception and unlock measurable growth.",
    "Solutions beyond the brief – We bring confidence to propose solutions customers need, not just asked for, ensuring transformation that drives higher aspirations and advantage.",
    "Proof in performance – Industry recognition such as Gartner award and partnerships with leaders like Perkins (Caterpillar) prove our ability to deliver distinctive solutions that redefine a business.",
    "Summary of key areas identified for exploration in the value proposition:",
    "Shape long-term transformation by defining a 10-year logistics vision that embeds resilience, predictability, innovation, and growth.",
    "Scale sustainability impact through zero-carbon warehousing, low-emission transport, and advanced carbon reporting to accelerate net zero progress.",
    "Streamline and future-proof operations with integrated, multi-brand models and digital tools that unlock efficiency, data visibility and smarter decisions.",
    "Engineer supply resilience by diversifying networks, embedding risk management and delivering future-proof solutions that protect operations.",
    "De-risk transformation with proven expertise and industry recognition that give Saint-Gobain confidence in achieving growth and sustainability targets."
  ]
}