{
  "type": "pptx",
  "file": "Magnus Consulting_ DHL GT accelerator_ Saint Gobain_ CCC Intelligence Report.pptx",
  "slides": [
    {
      "slide_number": 1,
      "text": [
        "DHL Golden Ticket",
        "Saint-Gobain market and competitor discovery",
        " ",
        "Sept",
        " 2025"
      ]
    },
    {
      "slide_number": 2,
      "text": [
        "2",
        "Contents",
        "Sizing the market opportunity ",
        "(slides 4 - 7)",
        "Secondary research market ",
        "view analysis ",
        "(8 – ",
        "18",
        ")",
        "Competitive landscape analysis ",
        "(slides",
        " 19",
        " – 28)",
        "Recent news and updates ",
        "(slides 29",
        "-31",
        ")",
        "Next steps ",
        "(Slide 32)"
      ]
    },
    {
      "slide_number": 3,
      "text": [
        "Saint-Gobain is consolidating multi-brand distribution into new regional hubs ",
        "that cut costs, reduce carbon",
        " ",
        "and improve service. ",
        "These hubs integrate sustainability and innovation (e.g. electrification, smart systems) directly into the customer experience, ",
        "reshaping expectations of what “good logistics” looks like to them.",
        "While competitors emphasise scale, sustainability and innovation, ",
        "they lack clear customer-focused positioning. ",
        "Saint-Gobain’s agenda ",
        "creates space for DHL to sharpen its narrative around business outcomes ",
        "- ",
        "moving beyond transactional value to transformational partnership.",
        "An opportunity to lead with transformational outcomes",
        "With 88% of construction firms prioritising sustainability and ",
        "76% applying ESG criteria in vendor selection, ",
        "Saint-Gobain (and their end customers) now expect partners to deliver low-carbon solutions as standard. ",
        "Coupled with the fact ",
        "86% of logistics providers are actively investing in AI, automation and visibility to meet demand for digitally enhanced supply chains",
        ".",
        "Sustainability and digital-first supply chains as baseline",
        "3",
        "Overarching key takeaways",
        "Reshaping logistics around regional hubs"
      ]
    },
    {
      "slide_number": 4,
      "text": [
        "Market Opportunity",
        "Sizing the Market"
      ]
    },
    {
      "slide_number": 5,
      "text": [
        "£15",
        "trillion",
        "5",
        "Global Construction Market: ",
        "forecast to reach $15 trillion by 2030",
        "UK building materials market: ",
        "valued at over £70 billion in 2023 and expected to grow steadily ",
        "Logistics and distribution spend:",
        " materials distribution accounts for 20-30% of project costs",
        "£100 ",
        "million",
        "Market forecast to reach £15 trillion by 2030",
        " ",
        "Size of the opportunity",
        "1 Oxford Economics, 2024: ",
        "https://www.oxfordeconomics.com/resource/future-of-construction/",
        "2 ONS, 2025: ",
        "https://www.ons.gov.uk/businessindustryandtrade/constructionindustry/articles/constructionstatistics/2023",
        "3 Oxford Economics, 2024: ",
        "https://www.oxfordeconomics.com/resource/future-of-construction/",
        "2 ONS, 2025: ",
        "https://www.ons.gov.uk/businessindustryandtrade/constructionindustry/articles/constructionstatistics/20",
        "logistics ",
        "partnerships ",
        "represent a £100m+ revenue opportunity"
      ]
    },
    {
      "slide_number": 6,
      "text": [
        "6",
        "Saint-Gobain is reshaping its logistics strategy to drive long-term growth",
        "Delivering on sustainability, digital transformation and an expanded network to improve customer service and efficiency.",
        "Digitalisation: ",
        "Investing in automation, smart supply chains, and predictive analytics to boost efficiency.",
        "Growth & Reach: ",
        "Expanding footprint with regional hubs.",
        "Customer-Centric Delivery: ",
        "Focusing on reliability, safety and faster time-to-site for customers.",
        "Saint ",
        "Gobain",
        " has set significant targets for sustainability & growth:",
        "Net 0 target",
        "2050",
        "New Southern DC",
        "2027"
      ]
    },
    {
      "slide_number": 7,
      "text": [
        "7",
        "The UK construction market is prioritising energy efficiency through net-zero targets, insulation schemes, and circular economy investment backed by the UK government.",
        "Key takeaway: Saint-Gobain are responding with major investment, indicating how they see this as a major strategic priority.",
        "The energy efficiency mandate in construction"
      ]
    },
    {
      "slide_number": 8,
      "text": [
        "“In a world moving towards net-zero carbon, we work in an industry - construction - that contributes 40% of the world’s CO₂ emissions… Working at Saint-Gobain means being committed to helping tackle some of the most important issues we face and doing the right thing.”",
        "- Richard Batley, HR & CSR Director, Saint-Gobain UK & Ireland",
        "Saint ",
        "Gobain",
        " is t",
        "argeting",
        " net-zero carbon by 2050, investing in low-emission fleets, electrification, and circular economy practices."
      ]
    },
    {
      "slide_number": 9,
      "text": [
        "Market Analysis",
        "Secondary Research"
      ]
    },
    {
      "slide_number": 10,
      "text": [
        "Over 86% of UK logistics firms plan to invest in digital tools within two years",
        ", with AI, IoT, and automation driving resilience, forecasting, and customer visibility. ",
        "For Saint-Gobain, digital-first supply chains are becoming essential to meet customer expectations ",
        "and integrate advanced analytics into everyday operations.",
        "Digital transformation is redefining supply chain performance",
        "88% of construction firms cite sustainability as a supply-chain priority, and 76% apply ESG criteria when selecting vendors. ",
        "For Saint-Gobain, this aligns with its net-zero by 2050 commitment, embedding low-carbon logistics and circular economy practices as ",
        "core priorities and key competitive differentiators for logistics providers.",
        "Sustainability is now a non-negotiable in construction logistics",
        "10",
        "Market view",
        " key takeaways",
        "Rising input costs and logistics inefficiencies are pushing firms to consolidate into larger regional hubs",
        ", driving economies of scale. Saint-Gobain is already adopting this model, cutting carbon and improving service through multi-brand hubs.",
        "This ",
        "means logistics partners must demonstrate capability to support consolidation",
        ", optimise flows and deliver sustainable, end-to-end solutions at scale.",
        "Consolidation is reshaping efficiency and cost models"
      ]
    },
    {
      "slide_number": 11,
      "text": [
        "11",
        "The shift towards regional hubs and integrated logistics in UK construction materials is reshaping competitive advantage",
        " ",
        "- favouring providers that can offer scale, service reliability and sustainable, end-to-end partnerships.",
        "Market View 1: Distribution",
        "McKinsey reports that materials distributors are evolving - acting as logistics hubs themselves",
        ", offering assembly, on-site planning, pre-delivery services, credit, etc., rather than just product supply. (",
        "McKinsey, 2023",
        ")",
        "Circular economy initiatives are driving the formation of regional material reuse / processing hubs, which could build into distribution infrastructure over time. (",
        "GCHU, 2024",
        ")",
        "STARK Group is launching its first purpose-built regional distribution hub in the UK, aiming to strengthen its service to merchants and tradespeople by ",
        "optimising",
        " branch footprint and improving material flow. (",
        "Stark Group, 2024",
        ")",
        "STARK UK’s network now includes hundreds of branches and distribution centers serving builders, showing scale and regional reach in materials supply. (",
        "Stark Group, 2024",
        ")"
      ]
    },
    {
      "slide_number": 12,
      "text": [
        "12",
        "Saint-Gobain is reshaping its own logistics model, ",
        "consolidating multi-brand distribution into regional hubs",
        " that cut costs, reduce carbon and improve customer service. ",
        "Market View 2: Consolidation",
        "Saint-Gobain UK has overhauled its supply chain by consolidating distribution for multiple product lines into new regional hubs. In late 2024 ",
        "it opened a flagship “Northern Distribution Centre” in Wakefield in partnership with XPO Logistics",
        ", serving as a one-stop shop for Saint-Gobain Interior Solutions brands in the north (",
        "Saint-Gobain, 2024",
        ") ",
        "“The facility operates as a multi-brand one-stop shop, enabling consolidated product delivery across multiple Saint-Gobain brands to reduce carbon emissions and improve customer service through single-vehicle multi-brand deliveries.” (",
        "Logistics Matters, 2024",
        ")",
        "Sustainability and innovation are built into the facility",
        ". All forklifts at the Wakefield DC are electric, avoiding emissions. XPO and SG coordinated robust backhaul operations there, so delivery trucks return loaded, eliminating empty runs and cutting carbon (",
        "Saint-Gobain article, 2024",
        ")",
        "“The company’s consolidated multi-brand delivery capabilities address key customer pain points in construction logistics, enabling multiple Saint-Gobain brand products to be delivered on single vehicles rather than separate deliveries.” (",
        "Saint Gobain, 2024",
        ")"
      ]
    },
    {
      "slide_number": 13,
      "text": [
        "13",
        "Sustainability is now a key priority in construction",
        ", with public sector and net-zero commitments pushing Saint-Gobain to prioritise low-carbon solutions across their supply chain.",
        "Market View 3: Sustainability",
        "88% of construction firms cite sustainability as a key supply-chain goal, and 76% use ESG criteria when selecting vendors ",
        "(",
        "WTW Construction Supply Chain Risk Report, 2023",
        ")",
        "In the UK highways sector, 67% of ",
        "organisations",
        " have published net-zero plans and ",
        "73% are even willing to pay a premium for sustainable options ",
        "(",
        "Transport+Energy blog, 2024",
        ")",
        "National Highways aims to cut construction emissions 50% by 2030, signaling public-sector demand for greener logistics (",
        "Atradius Construction Industry Trends, 2023",
        ")",
        "Companies are responding with green fleets and fuels. Use of electric vehicles in freight is climbing (commercial EV count +31% from 2023 to 2024), with nearly 1,300 electric HGVs are now on UK roads (28% increase in a year) (",
        "Logistics UK, 2024",
        ")"
      ]
    },
    {
      "slide_number": 14,
      "text": [
        "14",
        "The construction industry is strengthening resilience post-pandemic to guard against future shocks, with ",
        "firms diversifying suppliers and embedding risk management as a result.",
        "Market View 4: Risk management",
        "The construction supply chain has ",
        "stabilised",
        " since the crisis peaks, but companies remain vigilant against disruptions. ",
        "80% of contractors have improved supply-chain management in response to recent shocks",
        ", investing in stronger supplier collaboration. Yet 66% admit a lack of alternative suppliers limits true resilience, underscoring continued vulnerability to single-source failures (",
        "WTW Construction Supply Chain Risk Report, 2023",
        ")",
        "58% of firms now rank climate and environmental factors among their biggest supply risks, and 37% say these could have high impact on projects (",
        "WTW Construction Supply Chain Risk Report, 2023",
        ")",
        "Deloitte highlights that pandemic-era disruptions have exposed vulnerabilities in supply chains, prompting firms to diversify material sources and build buffer strategies. (",
        "Deloitte, 2024",
        ")",
        "Transparency across multiple tiers of the supply chain (including data flows, technical compliance, and quality control) has become a critical concern; lower tiers lacking visibility pose risks of delays, defect, and non-compliance (",
        "Gov.uk Construction Products Supply Chain Report, 2025",
        ")"
      ]
    },
    {
      "slide_number": 15,
      "text": [
        "15",
        "Rising cost pressures and volatile material prices are pushing construction companies to ",
        "streamline operations, cut waste and redesign networks for greater efficiency.",
        "Market View 5: Efficiency",
        "After two years of sharp increases, building material prices have started to ease – the UK index of construction material costs was down 4.0% year-on-year in July 2023 (",
        "Gov.uk Monthly statistics of building materials report, 2023",
        ")",
        "High interest rates and economic uncertainty are dampening new construction, forcing firms to control costs. UK housing starts have flatlined in 2023 as borrowing costs spiked, with builders shifting focus to renovations and backlog work instead (",
        "Zilliant Trends Report, 2023",
        ")",
        "36% of construction companies still fear energy or utility disruptions will significantly impact projects",
        ". Many materials (brick, cement, glass) are energy-intensive to produce, so energy price swings hit input costs and delivery expenses.(",
        "WTW Construction Supply Chain Risk Report, 2023",
        ")",
        "Distributors are closing older, inefficient depots and upgrading to larger, regional hubs that offer economies of scale",
        ". For instance, Travis Perkins opened a new automated central warehouse in 2023 and shuttered smaller sites, seeking lower unit handling costs and inventory reduction across its network (",
        "Travis Perkins Group Report, 2023",
        ")"
      ]
    },
    {
      "slide_number": 16,
      "text": [
        "16",
        "Construction is accelerating its digital shift",
        ", with solutions like automation and data-driven tools seen as ",
        "critical  in transforming supply chain performance for Saint ",
        "Gobain",
        ".",
        "Market View 6: Digitisation",
        "Industry executives are responding to recent supply chain turmoil with a “renewed focus on innovation and digital transformation” (",
        "Zilliant Trends Report, 2023",
        ")",
        "In the latest ",
        "Glenigan",
        " survey of 723 professionals, 70%+ report using BIM and cloud tools",
        ", and 57% took part in at least one project using off-site/manufacturing methods in the past 12 months, signaling a clear shift to digital-by-default delivery models. (",
        "NBS Digital Construction Report, 2023",
        ")",
        "Telematics and connected equipment are scaling fast, improving fleet visibility and uptime. The global installed base of construction-equipment OEM telematics hit 6.8 million units in 2023 and is forecast to grow 12% CAGR to 12.1 million by 2028, underpinning data-driven maintenance, routing and ",
        "utilisation",
        " in UK fleets. (",
        "BergInsight, 2024",
        ")",
        "UK logistics operators are investing to ‘go digital’ end-to-end. ",
        "In a 2024 survey of 89 UK logistics firms, 86.5% plan to invest in digital transformation over the next two years; ",
        "69% expect digital trade documents to become standard, helped by the UK Electronic Trade Documents Act (2023); yet 62.9% cite insufficient digital skills as a barrier, reinforcing demand for user-friendly automation and control-tower tools (",
        "Neos Networks, 2024",
        ")"
      ]
    },
    {
      "slide_number": 17,
      "text": [
        "17",
        "Market View 7: Logistics",
        "Construction will need a quarter-million extra workers by 2028",
        ". CITB’s latest Construction Skills Network projects the UK industry must recruit ~251,500 additional workers by 2028 to meet expected workloads — a sustained, structural gap that cascades into haulage, warehousing, and on-site logistics demand (",
        "Construction Skills Network Industry Outlook, 2024",
        ")",
        "A British Chambers of Commerce survey found 82% of UK construction & engineering firms were struggling to hire — up from 69% earlier in the year — with similar pressure reported in transport and logistics roles. (",
        "Reuters, 2024",
        ")",
        "Since 2019 the UK construction workforce has shrunk ~14%, with ~38,000 vacancies per month in 2023; industry leaders link project delays and higher costs to the shortfall, compounded by post-Brexit migration patterns and global competition for skilled labour (",
        "Financial Times, 2024",
        ")",
        "ONS reports 718,000 vacancies (May–Jul 2025) across the UK, with unemployment-to-vacancy rising to 2.3 — still tight by historical standards and keeping pay pressure elevated for logistics and warehouse roles even as vacancies cool from 2022 peaks (",
        "ONS, 2025",
        ")",
        "Labor shortages and skills gaps force the construction industry to find solutions and confront persistent ",
        "workforce constraints that drive costs, delay projects and strain supply chains."
      ]
    },
    {
      "slide_number": 18,
      "text": [
        "18",
        "Saint-Gobain is driving ",
        "a digital-first supply chain strategy",
        ", ",
        "using advanced analytics, automation and partnerships to optimise logistics performance and cut carbon.",
        "Market view 8: Digital first",
        "Saint-Gobain is investing heavily in digital tools and data to optimize its supply chain (“Supply Chain 4.0” program",
        "). Globally and in the UK, SG uses advanced route planning software, load optimization algorithms, and simulation modeling to drive efficiency in transport (",
        "SG Integrated Report, 2023",
        ")",
        "“Saint-Gobain’s digital transformation priorities encompass end-to-end supply chain visibility, automated workflows, and integrated data management systems.” (",
        "Planisware.com, 2024",
        ")",
        "Analytics and modeling help balance cost, service, and carbon goals. SG’s simulation software evaluates different network scenarios to find the best trade-offs between delivery speed, inventory levels, logistics costs, and CO₂ footprint. In practice, this enabled moves like the consolidation into regional hubs and smarter deployment of the fleet (",
        "SG Integrated Report, 2023",
        ") ",
        "“Saint-Gobain has formed strategic partnerships for digital innovation, including acquisitions of Glass Service for glass furnace control systems and collaborations with startups like ",
        "Sysdyne",
        " Technologies for ready-mix concrete optimization.” (",
        "Saint-Gobain, 2024",
        ")"
      ]
    },
    {
      "slide_number": 19,
      "text": [
        "19",
        "Saint-Gobain is ",
        "embedding sustainability into every part of its supply chain",
        ", partnering with logistics providers to cut emissions and set industry benchmarks.",
        "Market view 9: Sustainability strategy",
        "Saint-Gobain UK&I has set bold sustainability targets that directly influence logistics decisions",
        ". The firm has a global commitment to net-zero carbon by 2050, with interim 2030 goals to cut Scope 1 and 2 emissions by 33% and Scope 3 by 16% ",
        "(from 2017 baseline) (",
        "Saint-Gobain, 2024",
        ")",
        "SG is piloting the use of alternative fuels like Hydrotreated Vegetable Oil (HVO) in some delivery trucks through partners. Notably, its long-running partnership with XPO includes trialing biofuel trucks and exploring electric vehicle technology for last-mile deliveries. Such collaborations earned Saint-Gobain and XPO a 2023 Multimodal Partnership Award, ",
        "recognising",
        " their joint efforts to cut emissions in distribution. (",
        "EV Magazine, 2024",
        ")",
        "Circular economy initiatives also tie into SG’s logistics – ",
        "they runs take-back schemes ",
        "(e.g. gypsum board recycling, pallet returns) which require efficient reverse logistics. In the UK, SG has glass and plasterboard recycling programs where trucks that made deliveries pick up waste materials on backhaul. This not only reduces raw material needs but also keeps trucks full both ways, improving transport efficiency. (",
        "Saint-Gobain, 2024",
        ")",
        "Saint-Gobain UK has been awarded ",
        "Gold status by the Supply Chain Sustainability School",
        ", placing it among the leaders in embedding sustainability into procurement and logistics practices. This recognition validates SG’s work in reducing emissions, integrating recycled content into packaging, and ensuring its partners meet high ESG standards (",
        "Supplu Chain School, 2024",
        ")"
      ]
    },
    {
      "slide_number": 20,
      "text": [
        "Competitor Landscape Analysis"
      ]
    },
    {
      "slide_number": 21,
      "text": [
        "XPO, CEVA, and GXO/Wincanton highlight their global or national scale alongside long-term customer partnerships, ",
        "presenting themselves as integral supply chain partners rather than transactional providers.",
        "Awards and recognition are not used as frequently ",
        "at sector level creating an opportunity for further credibility. ",
        "Expertise & partnerships are central to competitor strategies",
        "Most leading competitors position their green initiatives and digital capabilities to reinforce value with customers and stakeholders. ",
        "These factors increasingly act as differentiators in construction logistics ",
        "due to the demand for such solutions in the sector ",
        "and from Saint ",
        "Gobain",
        ".",
        "Competitors emphasise sustainability and innovation as proof ",
        "of value",
        "21",
        "Competitor key takeaways",
        "Several competitors stress construction market leadership and end to end sustainability, ",
        "others lean heavily on capability ",
        "including the scale of their operations and innovation.",
        "This creates ",
        "an opportunity for DHL to sharpen its narrative by focusing on transformational business outcomes ",
        "that align to key customer priorities and concerns. ",
        "Positioning remains fragmented across the market, creating space for clarity"
      ]
    },
    {
      "slide_number": 22,
      "text": [
        "22",
        "The competitive landscape",
        "Competitor Analysis"
      ]
    },
    {
      "slide_number": 23,
      "text": [
        "Audience benefit ladder",
        "Emotional benefit",
        "Transformational benefit",
        "Societal benefit",
        "Functional benefit",
        "Attributes",
        "How does it change society",
        "How does it change my life",
        "How does it it make me feel",
        "What do I get?",
        "Product USP / features",
        "Brand/",
        "buyer enablement",
        "Product and service messaging",
        "GTM value proposition",
        "Competitor",
        " positioning and messaging"
      ]
    },
    {
      "slide_number": 24,
      "text": [
        "Competitor insight 1: Top level positioning",
        "While competitors emphasise scale, sustainability and innovation, none have established a clear customer focused positioning – presenting an opportunity to own the narrative around more transformational outcomes.",
        "GXO Logistics",
        " is positioning itself as the UK’s largest pure-play contract logistics provider following its Wincanton acquisition. It highlights ",
        "consolidation strength, sector expertise in building materials,",
        " and operational excellence with Saint-Gobain, supported by award recognition and advanced hub technology. ",
        "CEVA Logistics",
        " emphasises ",
        "global scale and sustainability leadership",
        ". Its integration into CMA CGM and acquisition of Bolloré strengthens reach, while its “Top Green Supply Chain Partner” recognition and 10% emissions reduction reinforce its green positioning ",
        "XPO Logistics",
        " highlights partnership-led differentiation in building materials, including its ",
        "deep collaboration with Saint-Gobain ",
        "and multimodal rail innovation with ",
        "Etex",
        ". It positions on ",
        "multimodal sustainability, proprietary tech, and delivery efficiency ",
        "Across competitors, ",
        "positioning is converging on sustainability and innovation",
        ", but each applies a different lens: GXO on scale and efficiency, CEVA on global green leadership, and XPO on sector partnerships and multimodal execution."
      ]
    },
    {
      "slide_number": 25,
      "text": [
        "25",
        "Competitor top-level positioning",
        "Competitor",
        "Solution",
        "Positioning",
        "DHL",
        "Sector page:",
        "“Tailored logistics solutions for semiconductor manufacturers",
        "DHL construction logistics.”",
        "Saint-Gobain",
        "Sector page",
        "\"Addresses the complex issues of new construction\"",
        "Wincanton/",
        "GXO Logistics",
        "Sector page",
        "\"At the heart of construction supply chains\"",
        "CEVA Logistics",
        "Sector page",
        "\"Building and digging new frontiers.\"",
        "XPO Logistics",
        "Sector page",
        "\"Construction Logistics Solutions. Safe, efficient, and tailored.\"",
        "Competitor Insight 1: Top level positioning - Context to support the insight",
        "*Sources in the notes"
      ]
    },
    {
      "slide_number": 26,
      "text": [
        "26",
        "Competitor top-level positioning",
        "Competitor Insight 1: Top level positioning - Context to support the insight"
      ]
    },
    {
      "slide_number": 27,
      "text": [
        "27",
        "Competitor top-level key themes",
        "Competitor",
        "Page",
        "Capabilities",
        "Market leadership",
        "Integration & completeness",
        "Partnership & support",
        "Other",
        "DHL",
        "Sector page",
        "✓",
        "• Certified expert teams with zero-defects mindset for project support ",
        "• State-of-the-art visibility tools: transport visibility, warehouse management systems, inventory / materials flow visibility",
        "✓",
        "“DHL is the world’s leading logistics provider\"",
        "✓",
        "Offers end-to-end suite: global transport, vendor and stakeholder management",
        "• special equipment handling, control towers with performance reporting ",
        "✓",
        "“Certified expert teams” / “vendor management expertise”",
        "✓",
        "Emphasis on high value / sensitive cargo, zero-defect mindset, control tower analytics, specialized equipment ",
        "Wincanton/",
        "GXO Logistics",
        "Sector page",
        "✓",
        "• Fleet includes Mechanical Off Load (MOL), ",
        "• Full visibility of deliveries; ability to handle off-site consolidation through to final site delivery",
        "✓",
        "Covers transport from production, off-site consolidation, final delivery; includes visibility tech, specialist fleet",
        "✓",
        "Visibility, specialized fleet, ability to manage complexity under tight performance and compliance demands.",
        "CEVA Logistics",
        "Sector page",
        "✓",
        "• Expertise in shipping out-of-gauge, cranes, diggers, derricks, concrete mixers ",
        "• Global & Regional Account Managers, Global",
        "✓",
        "\"CEVA’s team have global expertise … in all aspects of construction equipment logistics…”",
        "✓",
        "Construction equipment segment where scale + specialized handling + reliability in complex requirement is emphasized.",
        "XPO Logistics",
        "Sector page",
        "✓",
        "• Tailored capabilities: HVO-powered HGVs, real-time route optimisation & analysis,",
        "•  Proprietary tracking (XPO Connect), safety and driver / warehouse performance metrics. ",
        "✓",
        "• ",
        "Offers fleet ",
        "modernisation",
        ", green fuel options, tracking / live visibility",
        "• ",
        "full suite of capabilities for construction logistics not just transport but compliance & environmental standards. ",
        "✓",
        "“end-to-end supply chain partner”",
        "✓",
        "Environmental sustainability (LESS, EVs, HVO), technology & visibility, safety & compliance in construction environments.",
        "Competitor Insight 1: Top level positioning - Context to support the insight"
      ]
    },
    {
      "slide_number": 28,
      "text": [
        "Competitor insight ",
        "3",
        ": Reasons to believe",
        "Competitors tend to build credibility at sector level by using their expertise and decisive proof points – as opposed to citing awards and recognition.",
        "Competitors like CEVA and XPO emphasise their ",
        "global networks",
        " and ",
        "owned transport fleets",
        ", positioning ",
        "scale as a guarantee of reliability and resilience ",
        "in logistics operations.",
        "Wincanton highlights its ",
        "net-zero by 2040 ambition",
        " and investment in electric and alternative-fuel fleets, while ",
        "XPO foregrounds its end-to-end sustainable solutions in Europe ",
        "to reassure customers of long-term alignment with ESG goals.",
        "GXO stresses its use of automation, AI, and robotics ",
        "in warehouses, while CEVA underlines ",
        "digital freight management and visibility platforms",
        ", presenting themselves as technology leaders in supply chain management.",
        "Saint-Gobain and XPO spotlight their Multimodal Partnership Award win",
        ", while CEVA and GXO highlight collaborations with high-profile brands (e.g., retail, automotive) as evidence of trust from major clients."
      ]
    },
    {
      "slide_number": 29,
      "text": [
        "29",
        "Reasons to believe ",
        "At a ",
        "sector",
        "/ solution level",
        "DHL",
        "Wincanton/GXO",
        "CEVA Logistics",
        "XPO Logistics",
        "GoGreen PLUS sustainable product portfolio (emission-reduced logistics services, book & claim in setting, verified by external auditors)",
        "Deployment of 1,000+ robots in UK operations; automation, robotics & digitalisation being key enablers under Strategy 2030",
        "Committed to achieving net-zero carbon by 2040",
        "“",
        "EyeQ",
        " platform / transport control tower” is used for route optimisation, visibility of vehicle usage/performance, and cutting emissions and cost",
        "Their environmental actions include “warehouse, fleet, ground operations, low carbon solutions” in partnership with industry players.",
        "Expertise in sustainable logistics solutions (e.g. alternative fuels, fleet electrification etc.)",
        "Recognised as a leading logistics company with deep sustainability credentials; strong ESG / net-zero commitment",
        "DHL committed to net-zero emissions by 2050; offering low-GHG/sustainable fuels / technologies across modes; carbon-neutral building operations etc.",
        "Strategy 2030 emphasises sustainable growth, growth + quality + digital innovation + environmental performance as core levers (not just add-ons)",
        "73 sites in the UK certified to ISO 14001 for environmental management.",
        "Participation in EcoVadis, reporting in CDP",
        "Strong CSR / sustainability foundation: their CSR commitments linked to CMA CGM, with focus on Environmental, Social & Governance pillars and aligning with SDGs.",
        "Motor Transport Awards 2023 - Partnership Award with Saint-Gobain UK & Ireland. ",
        "Their 'LESS' (Low Emission Sustainable Solutions) offering launched, investment in technology, fleet, facilities, employee training.",
        "EcoVadis",
        " Gold Medal (Europe) for CSR & sustainability performance, 2024. ",
        "KEY:",
        "Awards & recognition",
        "Expertise",
        "/Differentiator",
        " ",
        "Proof points",
        "At a brand",
        " ",
        "level",
        "Competitor Insight 3: Reasons to believe - Context to support the insight"
      ]
    },
    {
      "slide_number": 30,
      "text": [
        "30",
        "Competitors spotlight sustainability, digital optimisation, and workforce development as ",
        "key differentiators in construction logistics partnerships.",
        "Recent competitor news",
        "The sample of news was reviewed for each competitor and M&G. The news articles were selected if they were published on or after 01.01.2023 and were related to platform offerings",
        "PepsiCo chooses XPO for sustainable UK transport services",
        " ",
        "(",
        "P&P Tech, 2025",
        ")",
        "CEVA Logistics launch of low-carbon UK road transport via HVO100 biofuel across its network",
        " ",
        "(",
        "CEVA Logistics, 2024",
        ")",
        "Wincanton and Jewson extend partnership via 'The WEB' automation & ",
        "eFulfilment",
        " facility",
        " (",
        "MultiModal UK, 2024",
        ")",
        "Wincanton awarded a five-year contract to manage Marshalls’ national transport network",
        " (",
        "CILT, 2024",
        ")",
        "XPO has been selected by PepsiCo as its core transport partner across four UK distribution sites. As part of the contract, XPO will deploy Mercedes-Benz eActros EV's from August, ",
        "converting more than 1 million road km annually from diesel to electric",
        ", reducing over 1,200 metric tons of CO₂ emissions per year. ",
        "CEVA is investing in infrastructure at 18 UK sites to make ",
        "HVO100 biofuel available for road transport operations",
        ". They’re targeting 450 vehicles using HVO by end 2025. Since 2021, they have used over 11 million litres, cutting CO₂e by 25,000+ tonnes. ",
        "Wincanton extended supply-chain services to over 400 Jewson branches, leveraging its automated ",
        "eFulfilment",
        " facility (“The WEB”) to improve delivery reliability, route efficiency, and fulfilment capabilities.",
        "As part of the deal, Wincanton now handles over ",
        "3.5 million tonnes of materials annually for Marshalls",
        ", covering both Landscape Products and Brick & Masonry transport. They’ll use the EyeQ digital platform for optimisation & sustainability gains."
      ]
    },
    {
      "slide_number": 31,
      "text": [
        "Competitors and ",
        "Saint-Gobain",
        "Recent news and updates"
      ]
    },
    {
      "slide_number": 32,
      "text": [
        "32",
        "Saint-Gobain and XPO are strengthening their long-standing partnership with new investments in innovation, sustainability, and delivery excellence.",
        "How competitors have been partnering with M&G",
        "XPO Logistics and Saint-Gobain",
        "Partnership",
        "Saint-Gobain and XPO open new Wakefield Northern Distribution Centre ",
        "(",
        "Insider Media, 2024",
        ")",
        "Saint-Gobain / XPO win Motor Transport “Partnership Award 2023” ",
        "(",
        "Europe News, 2023",
        ")",
        "SG and XPO’s partnership won external recognition for their long-standing collaboration around ",
        "safety, sustainability, customer experience and cost-delivery",
        ". ",
        "Saint-Gobain UK partnered with XPO to launch a multi-brand warehouse in Wakefield, serving the North and Midlands. The site strengthens ",
        "SG’s ability to consolidate deliveries and reduce emissions",
        ". "
      ]
    },
    {
      "slide_number": 33,
      "text": [
        "Summary of",
        "key themes"
      ]
    },
    {
      "slide_number": 34,
      "text": [
        "34",
        "Market growth potential",
        "Footprint expansion ",
        "Sustainability commitments",
        "Digital transformation drive",
        "Regional hub shift",
        "Cost and efficiency pressure",
        "Labour and skills shortage",
        "Market opportunity ",
        "Mapping the themes",
        "Sustainability as differentiator",
        "Digital-first supply chains",
        "Regional hub consolidation",
        "Rising cost pressures",
        "Risk management imperative",
        "Labour and skills gap",
        "Efficiency and resiliency",
        "Partnerships that scale",
        "Demand for innovation",
        "Pressure for end-to-end solutions",
        "Market view ",
        "Customer narrative gap",
        "Sustainability leadership focus",
        "Tech & innovation at the core",
        "Scale and consolidation",
        "Partnership-led positioning",
        "An opening for awards & recognition",
        "Sector specialisation emerging",
        "Innovation as hygiene factor",
        "Competitor analysis"
      ]
    },
    {
      "slide_number": 35,
      "text": [
        "35",
        "Next steps",
        "DHL to provide thoughts and feedback ",
        "Value proposition and DMU mapping workshop ",
        "Value proposition creation "
      ]
    },
    {
      "slide_number": 36,
      "text": []
    }
  ]
}