{
  "type": "pptx",
  "file": "Magnus Consulting_ DHL GT accelerator_ AG Barr_ CCC Intelligence Report.pptx",
  "slides": [
    {
      "slide_number": 1,
      "text": [
        "Commercial and Competitor Intelligence Report",
        "Golden Ticket Accelerator",
        "September 2025",
        "DHL and AG Barr"
      ]
    },
    {
      "slide_number": 2,
      "text": [
        "2",
        "Contents",
        "Sizing the market opportunity ",
        "(slides 4 - 7)",
        "Market view ",
        "(slides 8-18)",
        "Competitive landscape analysis ",
        "(slides 19 - 29)",
        "Recent news and updates – ",
        "C",
        "ompetitors and ",
        "AG Barr",
        " ",
        "(slides 30 - 31)",
        "Next steps"
      ]
    },
    {
      "slide_number": 3,
      "text": [
        "Rising cost pressures and the need for efficiency mean ",
        "AG Barr is prioritising automation, AI, and digital tools. ",
        "DHL can position themselves as a strategic partner ",
        "for AG Barr helping them to balance cost reduction with innovation, building a more competitive and future-ready supply chain.",
        "Competitors highlight flexibility, networks and automation, but ",
        "not the transformational outcomes these enable. ",
        "This gap ",
        "allows DHL to create a distinctive positioning ",
        "to AG Barr",
        " ",
        "by leading with growth, resilience and long-term customer value – areas that align to AG Barrs growth strategy. ",
        "The importance of outcomes over capabilities ",
        "AG Barr is ",
        "embedding sustainability into its future growth strategy ",
        "through net zero targets and greener logistics practices.",
        "This creates strong alignment with DHL, ",
        "who can help AG Barr scale credible, outcome-driven sustainability across its supply chain",
        " – a topic that ",
        "many competitors are not emphasising in their positioning. ",
        "Sustainability is shaping AG Barr’s supply chain strategy",
        "3",
        "Overarching key",
        " takeaways",
        "Tech and cost-effectiveness remain priorities"
      ]
    },
    {
      "slide_number": 4,
      "text": [
        "Market opportunity",
        "Sizing ",
        "th",
        "e market"
      ]
    },
    {
      "slide_number": 5,
      "text": [
        "Valued at $253.4bn in 2024 and forecast to reach $394.5bn by 2033, ",
        "the UK FMCG markets forecasted performance and growth is being reshaped",
        " by consumer expectations, cost inflation, regulatory pressure, and digitalisation.",
        "1.2",
        "5",
        "The key forces shaping FMCG growth ",
        "Rules and regulations",
        "Labour shortages, 12–15% transport cost rises, and stricter compliance standards are straining supply chains.",
        "Partner ",
        "expectations",
        "Businesses want integrated and tailored supply chain solutions that balance cost, resilience, sustainability and digital maturity. ",
        "Food & beverage as a catalyst",
        "Food & beverage logistics is a significant part of the FMCG sector worth $128bn; with cold-chain alone contributing $21bn.",
        "1. https://www.imarcgroup.com/uk-fmcg-market",
        " 2. ",
        "https://www.cognitivemarketresearch.com/list/food-&-beverages/food-and-beverages-logistics",
        "  3. ",
        "https://www.grandviewresearch.com/horizon/outlook/logistics-market/uk",
        " 4. ",
        "https://www.unitetheunion.org/news-events/news/2025/june/wincanton-hgv-drivers-to-take-industrial-action-over-pay",
        " 5. ",
        "https://www.binarysemantics.com/blogs/supply-chain-sustainability-trends/",
        " 6. ",
        "https://bramwithconsulting.co.uk/navigating-uk-supply-chain-challenges-in-2024/",
        " 7. ",
        "https://totalsupplychainsummit.co.uk/briefing/building-supply-chain-resilience-in-2024/",
        "1. ",
        "2.",
        "3. "
      ]
    },
    {
      "slide_number": 6,
      "text": [
        "6",
        "AG Barr is expanding brands and accelerating growth",
        "Delivering strong sales growth, expanding through acquisitions and investing in future capacity.",
        "1. ",
        "https://www.bbc.co.uk/news/uk-scotland-scotland-business-63840252",
        " 2. ",
        "https://www.agbarr.co.uk/media/stphb22y/2024_25-agb-interim-results-presentation-final.pdf",
        "  3. ",
        "https://www.asiantrader.biz/ag-barr-to-change-direct-to-store-delivery-model-and-fully-integrate-boost-business ",
        " 4. ",
        "https://www.agbarr.co.uk/media/z1mfri2i/48462-ag-barr-annual-report-2024-web.pdf",
        " ",
        "Growth:",
        " IRN-BRU has achieved double-digit sales growth in England.",
        "Brand expansion:",
        " Integration of Boost Drinks (£32m acquisition) strengthening the portfolio.",
        "Investment:",
        " £150m committed to supply chain upgrades and production capacity.",
        "AG Barr is ",
        "delivering strong performance",
        ":",
        "Expanding margins to 13.5%, targeting 14–15% by 2025/26.",
        "4",
        "2024",
        "£400M revenue",
        "+25.9% YoY"
      ]
    },
    {
      "slide_number": 7,
      "text": [
        "“As a responsible business this is a hugely important ",
        "programme",
        " for us.  But today’s announcement is only the start.  Under our No Time To Waste ",
        "programme",
        " we are ",
        "openly committing to be carbon net zero by 2040",
        ", if not sooner, and plan to involve all our staff, suppliers and customers in achieving our long-term vision”",
        "- Roger White, AG Barr Chief Executive Officer",
        " ",
        "https://grocerytrader.co.uk/no-time-to-waste-as-irn-bru-maker-moves-to-be-net-zero-by-2040/",
        " ",
        "AG Barr is driving ambitious ESG commitments, targeting net zero by 2040, with 43% carbon reduction already achieved and 100% renewable electricity across sites."
      ]
    },
    {
      "slide_number": 8,
      "text": [
        "8",
        "AG Barr is deliberately building a more efficient, resilient, and future-ready supply chain to ",
        "fueld",
        " their brand growth and market expansion.",
        "Key takeaway: AG Barr sees its supply chain as a strategic growth lever - not just operations",
        "Viewing supply chain as a growth advantage",
        "AG Barr investment case April 2025"
      ]
    },
    {
      "slide_number": 9,
      "text": [
        "Market view ",
        "Secondary Research"
      ]
    },
    {
      "slide_number": 10,
      "text": [
        "AI, IoT and automation are being deployed across FMCG supply chains",
        " to improve visibility, forecasting, and service reliability. ",
        "AG Barr is investing £19m in a multi-year supply chain programme and £2.5m in systems infrastructure to expand WMS and API integration. This means that ",
        "digital capabilities are now essential proof points for logistics providers.",
        "With inflationary pressures, cost-to-serve is under the spotlight. Transportation prices alone grew 66.8% in December 2024, ",
        "driving FMCG firms to consolidate warehouses and embed efficiency into procurement. ",
        "AG Barr is following this trend, changing AG Barr Direct in 2024 to ",
        "streamline service and reshaping distribution to optimise cost while scaling growth.",
        "Cost optimisation remains a top priority",
        "There is a massive focus on sustainability with, 62% of global FMCG leaders now considering it a key driver of long-term growth and ",
        "AG Barr already achieving a 43% carbon reduction across operations.",
        "These efforts ",
        "respond to consumer expectations and regulatory pressures ",
        "while also offering long-term opportunities for resilience and brand credibility.",
        "Sustainability is becoming central to growth strategies",
        "10",
        "Market view: Key",
        " takeaways",
        "Digital transformation is reshaping supply chains"
      ]
    },
    {
      "slide_number": 11,
      "text": [
        "Logistics are on the rise, with transportation expenses increasing by 12% in 2023 (",
        "Cognitive Market Research, 2025",
        ")",
        " ",
        ", in conjunction with fuel, energy and labour inflations, subsequently causing ",
        "transportation prices growing at 66.8% in December 2024",
        ", the fastest rate since April 2022. (",
        "Logistics Managers Index, 2024)",
        "Warehouse consolidation is trending as companies optimise distribution networks to reduce logistics spend. Competitors who have implemented data-centred infrastructure have seen growth. (",
        "Retail Technology Innovation Hub, 2024)",
        "Cost considerations are now balanced against resilience factors, with ",
        "60% of companies investing in green logistics practices and 85% having waste-reduction programmes",
        ", whilst also prioritising suppliers with strong ESG credentials. Through sustainable efforts, many companies are gaining tax credits and grants that justify the cost of sustainable innovation long-term. (",
        "JUSDA-EN, 2025)",
        "11",
        "FMCG players are ",
        "prioritising cost optimisation, ",
        "balancing inflation with efficiency to protect margins and sustain growth.",
        "Market ",
        "View ",
        "1: Cost"
      ]
    },
    {
      "slide_number": 12,
      "text": [
        "12",
        "Rapid digital transformation in FMCG is raising the bar on efficiency and visibility, ",
        "making it critical to embed technology that enhances supply chain resilience and customer experience.",
        "Market View",
        " ",
        "2",
        ": Digitisation",
        "47% of UK logistics companies are implementing AI and IoT solutions ",
        "to enhance visibility and predictive analytics. The food and beverage logistics market is increasingly utilizing blockchain technology to improve transparency and traceability, leading to supply chain efficiencies. ",
        "(",
        "Cognitive Market Research, 2025",
        ")",
        "API-ready systems and cloud-based platforms are now essential for FMCG firms to support omnichannel operations enabling efficient supply chain management, inventory optimization, and demand forecasting. By implementing these logistics strategies, FMCG companies can improve operational efficiency, adapt to changing market dynamics, enhance customer satisfaction, and gain a competitive edge ",
        "(Maersk, 2024)",
        "AI-powered analytics can ",
        "optimise",
        " routes for trucks and ships, reducing fuel consumption and emissions. A study by McKinsey & Company found that ",
        "AI-driven logistics solutions can reduce logistics costs by up to 10% and emissions by 5%",
        " .(",
        "McKinsey & Company, 2022)"
      ]
    },
    {
      "slide_number": 13,
      "text": [
        "13",
        "Workforce shortages are inflating costs across FMCG, ",
        "making it vital to balance automation with effective retention strategies ",
        "to protect supply chain resilience.",
        "Market view 3",
        ": ",
        "Workforce challenges",
        "Labor shortages persist across the logistics sector, with ",
        "27% of logistics professionals citing skilled worker availability as a significant challenge",
        ". (",
        "Bramwith, 2024)",
        ".",
        "An annual survey among 100 senior decision-makers in the logistics industry, ",
        "staff shortages and increased labor costs were seen by 78 percent",
        " as a current challenge that had a significant impact on their business’ performance. (",
        "Infios, 2023",
        ")",
        "The shortage of LGV drivers is creating significant wage inflation in the UK transport sector. Like all other costs, retailers, wholesalers and logistics operators are having to pass these costs on to the consumer to offset the cost increases they are seeing themselves. (",
        "Ascali",
        ")",
        " The UK-based Chartered Institute of Logistics and Technology conducted a survey in 2022 which showed 80% of respondent ",
        "organisations",
        " have staff shortages in warehouses, and 60% are short of driver. The Chartered Institute of Logistics and Technology and researchers have stated automation, AI technologies, and robotics could help to fill the gaps.  (",
        "The Chartered Institute of Logistics and Transport, 2022",
        "; ",
        "Tjondronegoro, D., et al. 2024",
        "). "
      ]
    },
    {
      "slide_number": 14,
      "text": [
        "14",
        "AG Barr will need to adapt to stricter safety, recycling & trade requirements due to ",
        "evolving regulations that demand enhanced compliance and logistics solutions.",
        "Market View",
        " 4: Regulations",
        "Brexit continues to reshape the UK logistics landscape with new border controls implemented in January 2024, requiring enhanced customs procedures and documentation capabilities. (",
        "Bramwith Consulting, 2024)",
        "The ",
        "UK Deposit Return Scheme and Extended Producer Responsibility ",
        "regulations are creating new reverse logistics requirements that logistics providers must accommodate. These regulatory changes favor established providers with comprehensive compliance capabilities and proven track records.",
        " (Veolia, 2023)",
        "The ",
        "European Green Deal aims for a 90% reduction in transport emissions by 2050",
        ", creating regulatory pressure for logistics providers to demonstrate measurable environmental improvements. (",
        "ECEEE",
        ", ",
        "amcsgroup, 2024",
        ")",
        "Plans to leave the single market will impact the cost of goods, with forecasts outlining that food and drink manufacturers will raise prices by 20% to compensate for inflation and increased production costs ",
        "(Market Inspector, 2024)"
      ]
    },
    {
      "slide_number": 15,
      "text": [
        "15",
        "Industry consolidation is reshaping competition, with ",
        "AG Barr’s integration strategy reflecting the wider market appetite  ",
        "for greater scale and diversification.",
        "Market view 5",
        ": Acquisitions",
        "Following the £32 million acquisition of Boost Drinks in December 2022, ",
        "AG Barr is implementing a comprehensive integration strategy",
        ". The in-sourcing of Boost and Rio production is progressing through 2024-27, with complete integration into Barr Soft Drinks delivering operational synergies and eliminating duplication. This integration creates opportunities for logistics providers who can support consolidation while maintaining service levels during the transition period (",
        "Asian Trader, 2024)",
        ".",
        "GXO completed the £762 million acquisition of Wincanton in April 2024",
        ", creating a combined entity with enhanced UK and Irish presence (",
        "Food Manufacturer, 2025",
        "). The CMA found that a loss of competition as a result of the merger “would likely lead to higher costs for grocers which, in turn, could be passed onto shoppers across the UK and lead to more expensive products at the checkout” (",
        "Logistics Manager, 2025",
        ").",
        "In the current climate, and with many retailers using an omnichannel approach, relying on a single supplier can be risky, especially during times of disruption. ",
        "Diversifying the supplier base across different regions ",
        "can provide greater flexibility and reduce the risk of supply chain interruptions ",
        "(Bramwith Consulting, 2025)",
        "."
      ]
    },
    {
      "slide_number": 16,
      "text": [
        "16",
        "As sustainability becomes an FMCG growth imperative, ",
        "AG Barr’s net zero ambitions align with DHL’s own strong commitment to sustainability and market strength.",
        "Market view 6: Sustainability",
        "UK businesses face mounting regulatory pressure and consumer demand for greener practices. Many are responding by integrating sustainability into their supply chains, exploring greener logistics options, using sustainable packaging, and partnering with suppliers who prioritise low-carbon practices. Implementing transparent tracking mechanisms can enhance credibility with stakeholders and improve traceability (",
        "Supply Chain Briefing, 2024)",
        "62% of global FMCG leaders consider sustainability a key driver of long-term growth",
        ", with Unilever and Nestle embedding sustainability metrics into their procurement scorecards and annual reporting structures ",
        "(IRE Journals, 2025)",
        ".",
        "European Green Deal regulations require a 90% reduction in transport emissions by 2050, raising pressure on FMCG supply chains., 3ith cold chain logistics, critical for beverage manufacturers, requires specialized sustainability solutions including natural refrigerants and energy-efficient warehouse systems (",
        "Cold Chain Federation, 2024",
        ")"
      ]
    },
    {
      "slide_number": 17,
      "text": [
        "17",
        "AG Barr rethinking distribution strategies and investing in new channels to drive growth ",
        "while optimising service and ",
        "cost-to-serve",
        ".",
        "Market view 7: AG Barr’s distribution strategy",
        "AG Barr implemented significant changes to its distribution strategy, closing Barr Direct operations in June 2024 and transitioning to wholesale channels supported by an expanded field sales team. This strategic shift affects approximately 200 jobs but creates more efficient supply chain operations and improved convenience channel service (",
        "Asian Trader, 2024",
        "; ",
        "Investing.com, 2025",
        ").",
        "AG Barr is executing an aggressive expansion strategy for IRN-BRU in England, achieving double-digit growth and 6.4% overall sales increase in 2024, requiring more sophisticated logistics (",
        "Business First, 2025",
        ").",
        "AG Barr’s FUNKIN range experienced rapid retail distribution growth, though facing challenges in the on-premise market. The brand's expansion requires specialized logistics capabilities for temperature-controlled products and flexible distribution models to serve both retail and hospitality channels",
        " (",
        "Scottish Business Intelligence, 2025",
        ")."
      ]
    },
    {
      "slide_number": 18,
      "text": [
        "18",
        "AG Barr ",
        "focusing on innovation and streamlining operations",
        " to drive efficiency, accelerate market expansion and meet fast-changing consumer demand.",
        "Market view 8",
        ": ",
        "Innovat",
        "ion at AG Barr",
        "AG Barr has invested £2.5 million in systems infrastructure and continues expanding digital capabilities including web portals and satellite tracking systems",
        ". The company's focus on digital strategy encompasses improved consumer experience, automation, and data analytics development. This technological evolution requires logistics partners with sophisticated WMS capabilities and API integration capabilities to support seamless data exchange (",
        "Arena Group",
        "; ",
        "AG Barr, 2024",
        ")",
        "AG Barr is investing £19 million in a multi-year supply chain program",
        ", including new production lines at its Cumbernauld factory to increase capacity and capabilities. These investments demonstrate AG Barr's commitment to operational excellence and create opportunities for logistics partners who can complement internal capabilities to support increased distribution complexity and ensure consistent product availability across new markets (",
        "AG Barr, 2025)",
        "."
      ]
    },
    {
      "slide_number": 19,
      "text": [
        "19",
        "AG Barr is ",
        "embedding sustainability at the core of its strategy, ",
        "prioritising",
        " credible partnerships to deliver against ambitious ESG goals.",
        " ",
        "Market view 9",
        ": Sustainability focus",
        "AG Barr has established ambitious environmental targets under its \"No Time To Waste\" program, committing to carbon net zero by 2040 – ten years ahead of the UK's 2050 deadline (",
        "Grocery Trader, 2021",
        "; ",
        "AG Barr, 2024",
        ")",
        "The company has achieved significant progress including 43% carbon emission reduction across operations, 100% renewable electricity at all sites, and 100% recyclable soft drinks packaging (",
        "AG Barr, 2024",
        ")",
        "The company's sustainability investments include transitioning to 100% recycled plastic (",
        "rPET",
        ") bottles across all brands by 2023, implementing 70-strong all-electric forklift fleet at warehouses, and achieving 10.7% improvement in water usage efficiency. These initiatives create specific requirements for logistics partners who can demonstrate complementary sustainability credentials and support AG Barr's net zero objective (",
        "Scottish Local Retailer, 2021",
        "; ",
        "AG Barr, 2024",
        ")"
      ]
    },
    {
      "slide_number": 20,
      "text": [
        "Competitor Landscape Analysis"
      ]
    },
    {
      "slide_number": 21,
      "text": [
        "Major players, ",
        "Culina",
        " and GXO/Wincanton highlight long-term customer partnerships, ",
        "presenting themselves as integral supply chain partners rather than transactional providers. ",
        "As well as using strong reference cases to ",
        "reinforce credibility.",
        "A clear space for differentiation in a competitive market",
        "DHL is uniquely positioned to pivot ",
        "from functional claims that competitors frequently use ",
        "(end-to-end, efficiency, flexibility) towards outcome-focused messaging.",
        "Especially around sustainability ",
        "that directly resonates with FMCG client priorities and DHL’s strengths.",
        "Customer-centric partnerships are central to competitor strategies",
        "​",
        "21",
        "Competitor landscape: K",
        "ey",
        " takeaways",
        "​",
        "Tech innovation is the key to cost effectiveness within the market",
        "Competitors are ",
        "increasingly using and investing in technologies",
        " ",
        "such as robotics, digital twins, and automated warehouse systems.",
        "The result is more efficient supply chains with enhanced resilience, lower ",
        "labour",
        " dependency and reduced energy consumption. The efficiencies impact both the businesses and their end customers",
        "."
      ]
    },
    {
      "slide_number": 22,
      "text": [
        "22",
        "The competitive landscape",
        "Competitors analysed in this section",
        "x",
        "(",
        ")"
      ]
    },
    {
      "slide_number": 23,
      "text": [
        "Audience benefit ladder",
        "Emotional benefit",
        "Transformational benefit",
        "Societal benefit",
        "Functional benefit",
        "Attributes",
        "How does it change society",
        "How does it change my life",
        "How does it it make me feel",
        "What do I get?",
        "Product USP / features",
        "Brand/",
        "buyer enablement",
        "Product and service messaging",
        "GTM value proposition",
        "Competitor",
        " positioning and messaging"
      ]
    },
    {
      "slide_number": 24,
      "text": [
        "While competitor positioning tends to be functionally focused, there is an opportunity for DHL to differentiate their positioning by focusing on outcomes that truly matter to FMCG clients, including sustainability.",
        "Competitor insight 1: Positioning",
        "Competitors emphasise functional delivery",
        ": Eddie Stobart and Great Bear highlight ",
        "flexibility and reliability",
        ", GXO/Wincanton lead with ",
        "automation and efficiency",
        ", and Iron Mountain focuses on digital disruption — but ",
        "most are centred on ",
        "what",
        " they deliver, not ",
        "why it matters",
        " ",
        "to clients.",
        "Limited sustainability leadership",
        ": While 62% of logistics firms are deploying sustainability ",
        "initiative, o",
        "nly",
        " ",
        "a select few competitors ",
        "(e.g. Wincanton, Iron Mountain) mention sustainability explicitly, and even then it is a secondary message, leaving space for DHL to take a stronger, outcome-led stance.",
        "Client outcomes are under-addressed",
        ": 60% of FMCG companies are increasingly demanding solutions that support ESG goals, yet ",
        "competitor positioning largely overlooks linking logistics capability to outcomes like carbon reduction, resilience, or circularity",
        ".",
        "Clear space for differentiation",
        ": DHL is uniquely positioned to pivot from functional claims (end-to-end, efficiency, flexibility) towards outcome-focused messaging",
        " ",
        "that directly resonates with AG Barr’s priorities."
      ]
    },
    {
      "slide_number": 25,
      "text": [
        "25",
        "Top-level positioning of competitor adviser platforms",
        "Competitor Insight 1: Positioning - Context to support the insight",
        "Competitor",
        "Solution",
        "Positioning",
        "DHL",
        "Consumer goods",
        "DHL Supply Chain delivers flexible, end-to-end, specialised supply chain solutions for over 550 consumer companies",
        "Eddie Stobart",
        "Consumer",
        "Logistics for retail companies of all sizes. ",
        "Great Bear",
        "FMCG",
        "Great Bear offers a full range of services to the FMCG sector; delivering service excellence by getting the right product to the right place at the right time.",
        "GXO",
        "Food and beverage",
        "Fully compliant warehousing and handling of frozen, refrigerated and ambient goods",
        "Wincanton",
        "Grocery and consumer",
        "We provide a full range of end-to-end direct-to-consumer (D2C) and outsourced supply chain services, from scalable warehousing and transport (‘shared networks’), to co-pack, returns, load sharing and customer services, underpinned by technology and automation.",
        "Iron Mountain ",
        "Warehousing and logistics",
        "Navigating today’s dynamic supply chain",
        "(Navigate today’s dynamic supply chain environment and build resilience by partnering with Iron Mountain Warehousing and Logistics).",
        "Malcom Logistics",
        "Logistics",
        "Malcolm Logistics, a Division of the Malcolm Group, is arguably the UK’s leading independent provider of third-party logistics services"
      ]
    },
    {
      "slide_number": 26,
      "text": [
        "26",
        "Competitor Insight 1: Positioning - Context to support the insight",
        "Top-level positioning of competitor adviser platforms"
      ]
    },
    {
      "slide_number": 27,
      "text": [
        "27",
        "Top-level positioning themes of competitor solutions",
        "Competitor Insight 1: Positioning - Context to support the insight",
        "Competitor",
        "End-to-end",
        "Flexible",
        "Reliable/efficient",
        "Digitisation/",
        "innovation",
        "Customer-centric",
        "Sustainability",
        "Other",
        "DHL",
        "✓",
        "DHL Supply Chain delivers flexible, end-to-end, ",
        "specialised",
        " supply chain solutions for over 550 consumer companies",
        "✓",
        "provide the flexibility to scale up or down",
        "✓",
        "“efficient operations’",
        "✓",
        "Dashboard visibility and control",
        " ",
        "✓",
        "Direct-to-consumer models delight customers and build brand loyalty",
        "✓",
        "ESG priorities across supply chain solutions",
        "“Speed and efficiency to improve speed to market”",
        "Eddie Stobart",
        "✓",
        "unrivalled ability to quickly respond to the constant fluctuations in demand that our customers face",
        "✓",
        "a trusted logistics partner for businesses of all sizes",
        "✓",
        "Technology enabled service excellence",
        "✓",
        "A dedicated partner",
        "Great Bear",
        "✓",
        "able to respond to sudden increases in consumer demand.",
        "✓",
        "Over 25 years of experience",
        "✓",
        "innovative solutions",
        "“Cost effective”",
        "GXO",
        "✓",
        "deliver flexible, cost-effective and compliant end-to-end solutions",
        "✓",
        "deliver flexible, cost-effective and compliant end-to-end solutions",
        "✓",
        "improve speed, accuracy and traceability",
        "✓",
        "advance their operations through automation deployment, network optimization and continuous improvement",
        "✓",
        "Customers trust us to deliver results ",
        "“Fully compliant”",
        "“Cost effective”",
        "”Speed”",
        "Wincanton",
        "✓",
        "Full range of end-to-end supply chain services",
        "✓",
        "operational efficiency",
        "✓",
        "underpinned by technology and automation",
        "✓",
        "We are an extension of our customers’ businesses",
        "✓",
        "Delivering sustainable food supply chains, minimizing social and environmental impact",
        "Iron Mountain",
        "✓",
        "Navigating today’s dynamic supply chain environment",
        "✓",
        "Our Magna Park North warehouse in Lutterworth is 'AA' Grade BRCGS accredited.",
        "“On time” ",
        "“Within your budget”",
        "Malcom Logistics",
        "✓",
        "intermodal service offers end-to-end distribution of products through road and rail integration",
        "✓",
        "focus on operational and service quality",
        "✓",
        "implementation of new technologies",
        "✓",
        "Key customer partnerships and alliances have been the cornerstones of our development"
      ]
    },
    {
      "slide_number": 28,
      "text": [
        "Competitors emphasise scale, technology and trusted partnerships to reinforce their credibility– there is a clear opportunity for DHL to enhance your use of proof points in this space.",
        "Competitor insight 2: Reasons to believe",
        "Eddie Stobart and Great Bear (",
        "Culina",
        ") highlight their ",
        "market leadership in chilled and ambient logistics",
        ", with 100+ UK sites and 8m sq. ft. of warehousing, reinforcing reliability through embedded FMCG contracts.",
        "GXO/Wincanton promote their ",
        "automation and global technology credentials",
        ", combining international expertise with local UK market knowledge to project resilience.",
        "Iron Mountain stresses its innovation-first model, using ",
        "robotics, AI-driven visibility, and ESG credentials ",
        "to position as a forward-thinking disruptor.",
        "Malcolm Logistics showcases its award-winning ",
        "intermodal solutions ",
        "and key customer partnership alliances."
      ]
    },
    {
      "slide_number": 29,
      "text": [
        "29",
        "Reasons to believe (1) ",
        "Competitor Insight ",
        "2",
        ": Reasons to believe - Context to support the insight",
        "DHL",
        "Eddie Stobart",
        "Great Bear",
        "Malcom Logistics",
        "We provide supply chain solutions across a range of industries, including food (frozen, chilled and ambient), beverages, media and entertainment, and household goods. ",
        "FMCG expertise includes:",
        "Optimising product portfolios for competitive advantage",
        " Implementing agile and efficient operations to improve speed to market",
        " Multi-channel distribution",
        "Specialised supply chain solutions for 500 consumer companies",
        "As the UK’s largest shared user network",
        "Trusted by brands you love (Morrisons, Coca-Cola, Britvic)",
        "Technology enabled service excellence.",
        "Extended intermodal network services.",
        "Over 25 years of experience providing cost-effective, innovative solutions.",
        "Great Bear offers a full range of services to the FMCG sector; delivering service excellence by getting the right product to the right place at the right time.",
        "Malcolm Logistics, a Division of the Malcolm Group, is arguably the UK’s leading independent provider of third party logistics services.",
        "5 BRC accredited sites.",
        "Key customer partnerships and alliances have been the cornerstones of our development ambitions,  as has our adoption and implementation of new technologies and our continuing investment in our state of the art fleet",
        "Warehousing facilities encompass over 5 million square feet of warehousing space, spread over 10 locations of which 3 are rail-side",
        "World’s leading contract logistics provider",
        "50+ countries in active operation ",
        "~1300 warehouses locations",
        "~39 million square meters of storage space",
        "~188,000 supply chain experts",
        "Stobart is the first Major UK Logistics provider in the UK to make the SBTi commitment",
        "2022 Global Awards – Most Sustainable Carrier Multimodal ",
        "(to note, they haven’t listed any awards since 2022)",
        "We have deployed a wide range of advanced supply chain solutions to meet our customers’ every need, driving efficiency and service excellence.",
        "2700+ vehicles",
        "3500+ trailers",
        "43 operating centres",
        "5000+ employees",
        "Great Bear is a leader UK ambient 3PL business providing nationwide contract logistics and supply chain management services to a range of companies across a variety of sectors.",
        "Trusted by the UK’s biggest brands (Vimto, Sainsbury’s, Unilever etc..)",
        "Over 30 sites and 7 million sq.ft storage ",
        "Practical solutions. Successful partnerships.",
        "At an FMCG logistics solution level",
        "At a brand level",
        "KEY:",
        "Awards & recognition",
        "Expertise ",
        "Proof points"
      ]
    },
    {
      "slide_number": 30,
      "text": [
        "30",
        "GXO",
        "Wincanton",
        "Iron Mountain",
        "GXO ranks as one of the top food and beverage logistics companies.",
        "Fully compliant warehousing and handling of frozen, refrigerated and ambient goods",
        "GXO has decades of experience in complying with critical regulatory mandates when managing food and beverage products in our temperature-controlled and ambient warehouse.",
        "GXO is a trusted partner for food and beverage logistics",
        "We also happen to be the safest British consumer goods supply chain provider. ",
        "Who we work: Heinz, Britvic (soft drinks), J&J etc..",
        "We provide a full range of end-to-end direct-to-consumer (D2C) and outsourced supply chain services.",
        "Wincanton provides services and expertise that support the delivery of consumer goods supply chain strategies:",
        "Automated and manual warehousing – dedicated and collaborative",
        "Direct-to-consumer",
        "Co-packing and repacking",
        "Customer service and order management",
        "Cash collection and debt management (LRS) ",
        "Dedicated and collaborative transport",
        "Supply chain partner",
        "2.2sq fit co-pack space, 3600 vehicles, 100m cases per year co-packed, 20.6 of companies planning to implement automation",
        "Our Magna Park North warehouse in Lutterworth is 'AA' Grade BRCGS accredited.",
        "With over 70 years of experience protecting our customers’ most valuable assets, you can count on all of our warehouses to be equipped with advanced security features and staffed by an experienced, trained, and vetted team of Mountaineers.",
        "AA MSCI ESG Rating, top among industry peers",
        "Top Suppy chain progects award (2022,23,24)",
        "Best practice in CSR  in Poland (2021,22,23)",
        "Many other awards, but these are most relevant to DHL and most recent.",
        "Game-changing innovation and automation",
        "Who are we: Logistics experts",
        "Scale: ~1000 warehouse locations, ~15k team members, 27 countries, ~200m sq.ft warehouse space, `~30% Fortune 100 companies are customers, $11.7billion revenue (2024)",
        "Results: 4-6x productivity improvement, 5x more items shipping using robotic automation, 5-7% average labour efficiency improvement ",
        "GXO is on track to meet or exceed our ESG goals:",
        "80% global operations using LED lighting by 2025",
        "80% global landfill diversion rate by 2025",
        "30% greenhouse gas emissions reduction from 2019 levels by 2030",
        "50% renewable electricity globally by 2030",
        "100% carbon neutral by 2040",
        "77% of waste associated with operations diverted from landfills globally in 2024",
        "Wincanton is trusted by global brands for our supply chain expertise. Our technology works alongside great people to deliver growth and to future-proof your business.",
        "Our customers: B&Q, IKEA, M&S etc..",
        "Winner of ",
        "The Warehousing Award: Above and Beyond – every woman awards 2025",
        "Nominated for other industry awards, but not won.",
        "Through a wealth of expertise, Wincanton provides business critical services for many of the best-known brands and organisations",
        "Our expertise extends across a variety of industries.",
        "Road to sustainability guide: informed with 500 decision makers in the fields of supply chain, transport and logistics.",
        "We’re trusted by the world’s leading organisations. And we’re ready to put our seven decades of experience to work for you.",
        "~95% of the Fortune 1000 trust us with their information and assets",
        "Over 240,000",
        "Customers in 61 countries",
        "26K+ professional ",
        "850MW+ global data center platform",
        "97M square feet of real estate",
        "70+ years proven experience ",
        "KEY:",
        "Awards & recognition",
        "Expertise ",
        "Proof points",
        "At an FMCG logistics solution level",
        "At a brand level",
        "Reasons to believe (2) ",
        "Competitor Insight ",
        "2",
        ": Reasons to believe - Context to support the insight"
      ]
    },
    {
      "slide_number": 31,
      "text": [
        "Competitors and AG Barr",
        "Recent news and updates"
      ]
    },
    {
      "slide_number": 32,
      "text": [
        "32",
        "Competitor news highlights pressures facing logistics firms, with most utilising technology, innovation and sustainability as a tool to combat this.",
        "Recent competitor and ",
        "AG Barr",
        " news",
        "In ",
        "July 2025",
        ", AG Barr acquired a majority stake in The Turmeric Co., a functional drinks producer, as part of its growth strategy (",
        "Food Bev, 2025",
        ")",
        "An opportunity for logistics firms to capture.",
        "Many Culina divisions saw ",
        "sharp profit declines",
        ": for example, ",
        "Eddie Stobart",
        " (its large transport arm) had operating profit fall ~39% to £24.3 m on revenues down 13.8%, reflecting contract losses and cost inflation (",
        "Ti-Insight, 2025",
        ")",
        "GXO and Greene King Partnership Turbocharges Operational Sustainability (",
        "Stock Titan, 2025",
        ")",
        "European Automation Push Might Change The Case For Investing In GXO Logistics (GXO) (",
        "Simply Wall st, 2025",
        ")",
        "GXO Logistics recently opened a state-of-the-art automated distribution center in Dorsten, Germany, in partnership with Levi Strauss & Co, as part of a long-term European expansion initiative.",
        "This facility showcases GXO's focus on advanced automation and sustainable logistics solutions, supporting its ongoing growth strategy in key European markets.",
        "EyeQ, innovation and collaboration lead the way as Wincanton nominated for five awards (",
        "Wincanton, 2025",
        ") ",
        "Wincanton HGV drivers to take industrial action over pay (",
        "Unite the Union, 2025",
        ")",
        "Unite general secretary Sharon Graham said: ",
        "\"Wincanton’s pay offer is pathetic this is a company that makes millions. Our members have been waiting for ages for a new pay offer and this is just a slap in the face.",
        " ",
        "“The workers will have the full support of Unite in their dispute.”"
      ]
    },
    {
      "slide_number": 33,
      "text": [
        "33",
        "Next steps",
        "DHL to provide feedback on market views and competitor landscape",
        "Magnus and DHL to define the DMU and inputs for the account value proposition and DMU – workshop on 24.09",
        "Account value proposition creation "
      ]
    },
    {
      "slide_number": 34,
      "text": []
    }
  ]
}