{
  "type": "docx",
  "file": "Magnus Consulting_DHL AG Barr_VP and DMU Workshop Summary.docx",
  "paragraphs": [
    "DHL Golden Ticket - AG Barr: Workshop Summary",
    "Exploring the voice of the customer – key themes:",
    "Your voice of the customer headlines ",
    "Key themes ",
    "DHL are the perfect strategic partner to unlock our growth and sustainability ambitions. – CEO/CFO",
    "DHL are a trusted, resilient partner. Our aligned goals create a sustainable future and shared growth. – SC director, TC director, C-suite",
    "DHL are our partner of choice to drive growth with scalability, green transport, and alternative fuels. – CS officer, Carl Donnan",
    "DHL meet all our needs, beyond supply chain, understanding ambition and driving growth across our business. – SC director",
    "DHL listen, innovate in proposals, understand our fundamentals, and remain trusted, competitive, and valuable in pricing. – SC director",
    "DHL want to partner with us and will invest in the relationship to enable growth. – CEO, SC officer",
    "DHL are a strategic partner enabling us to maximise our growth potential. – SC director",
    "DHL provide everything we need now and are the partner we trust to grow with. – 3PL Partner, Greg Dowdor, SC director",
    "DHL lead in sustainable transport with expertise to help us grow and transform our business. – CEO",
    "DHL listened, offered growth options, fully understand our business, and see us as a key strategic partner. – SC director, TC director",
    "Strategic growth partner ",
    "Sustainability leadership ",
    "Trusted and resilient partner ",
    "Scalable solutions for growth ",
    "Commercial innovation & agility",
    "Deep customer understanding ",
    "Long-term value creation ",
    "Investment in partnership ",
    "Operational excellence ",
    "People and collaboration ",
    "Future-ready expertise ",
    "Defining the decision making unit:",
    "Decisions makers: ",
    "CFO/COO, Chief SC officer, CEO, Head of logistics, Supply Chain Director",
    "Wider influencers:",
    "Chief of legal and sustainability, Board, CTO, Operations Manager, CCO",
    "Wider community: ",
    "Procurement lead, Operations Manager, Operations Director",
    "Three confirmed audience groups with key priorities and themes:",
    "THEMES",
    "Supply Chain Officer",
    "CFO/COO",
    "CEO (and sustainability)",
    "TOP 3 PRIORITIES",
    "Production continuity: keep manufacturing running without disruption",
    "Infrastructure readiness: capacity that meets current and future needs",
    "Growth capacity: scalable solutions that that enable expansion",
    "Growth ambitions: realised with maximum operational effectiveness",
    "Retailer service agreements: met to avoid penalties and reputational risk",
    "Sustainability goals: progress on scope 3 reductions, enabling focus on scope 1 and 2",
    "Business growth: delivered in the ‘right way’",
    "Resilience: supply chain able to adapt through change",
    "Brand protection: confidence in the partner to reduce risk",
    "ALL OTHER THEMES",
    "Space constraints alleviated so focus stays on brands and production",
    "Visibility and control through data and scalable, sustainable sites",
    "Green credentials to meet consumer preferences and support sustainable brand growth ",
    "Lower investment risk with flexible, phased growth",
    "Capital efficiency – we invest, they gain pay-as-you-grow flexibility and stronger returns",
    "Investor confidence from robust forecasts and market stability",
    "Scalability aligned to acquisitions, with solutions fit for purpose to hit agreements",
    "Financial stability underpinned by disciplined capital investment",
    "Peace of mind from a collaborative relationship, support through change and growth at their pace",
    "Ambitions aligned with solutions 100% adapted to needs",
    "Flexible network access and sustainable transport including RES",
    "Reassurance through proven impact and trusted partnership",
    "Defining our points of difference that matter:",
    "Sustainability in motion – As the first logistics provider to commit to science-based targets, with Ecovadis silver/gold ratings and low-carbon transport, we help customers deliver ESG commitments credibly.",
    "Clarity without compromise – Our open-book culture and data-driven platforms give customers real-time visibility into performance, ensuring accountability and trust across the supply chain.",
    "One system, every solution – From transport to co-packing, procurement and design, our single-provider model integrates services into one accountable solution, reducing complexity and boosting efficiency.",
    "Future powered today – Backed by major investments in assets, technology and digital tools, we deliver solutions that transform operations and keep customers ahead of industry change.",
    "Catalysts of transformation – With a proven track record enabling change for brands like Mars and Sainsbury’s, we act as a trusted partner guiding ambitious agendas with confidence.",
    "Resilience without compromise – Recognised for cyber security and operational excellence, we deliver reliable supply chains that withstand disruption and protect business continuity.",
    "Infrastructure for tomorrow – Beyond traditional supply chains, our ability to design and build facilities to exact requirements (through RES) delivers scalable, future-ready solutions aligned to growth.",
    "Credibility you can count on – Independent recognition, including Gartner Magic Quadrant placement and major investments, reinforces industry leadership and trust in our capabilities.",
    "Human advantage – With strong EOS scores, HR-led initiatives and DHL Foundation commitments, we attract and retain talent while embedding a culture of consistent excellence.",
    "Built around your success – Our brand promise is to make customers successful, combining bold ideas with tailored solutions that align with long-term ambitions over short-term transactions.",
    "Summary of key areas identified for exploration in the value proposition:",
    "Unlock scalable growth with warehousing, transport, and infrastructure solutions that flex with business needs and enable brand expansion.",
    "Guarantee operational resilience through reliable service, cyber-secure supply chains, and proven risk management in high-demand environments.",
    "Lead sustainability transformation with science-based targets, net-zero warehousing and low-carbon transport solutions that build green credentials.",
    "De-risk investment with ‘pay as you grow’ models that reduce capital exposure and unlock new growth opportunities.",
    "Build a trusted partnership grounded in trust and shared value creation, enabling growth at pace through change."
  ]
}