{
  "statementSource": "Magnus – Value Proposition Angles AG Barr_V2.pdf, p. 3–6",
  "statement": [
    "Growth at pace, without compromise.",
    "Availability drives every FMCG sale. When brands grow fast, only supply chains that keep pace can continually raise service levels and build trust.",
    "DHL is agile by design – helping AG Barr respond fast to any spikes in demand, ensuring products keep moving, customers stay supplied and retailers remain confident.",
    "Experience flexible models and future-ready logistics that free you to focus on building great brands. The result: no trade-offs or delays, just supply chain momentum that delivers consistent growth and keeps you ready for whatever is next.",
    "Growth at pace, without compromise."
  ],
  "subMessages": [
    {
      "title": "1. Space to expand today. Confidence it lasts tomorrow.",
      "source": "Magnus – Value Proposition Angles AG Barr_V2.pdf, p. 5–6",
      "bullets": [
        "AG Barr has ambitious plans for sustainable growth. DHL provides the space to expand at pace and the infrastructure to support sustainability goals from the ground up.",
        "Unlock flexible capacity across warehousing and transport to meet demand and enable brand expansion without disruption.",
        "Deliver lasting business impact, with infrastructure that scales and has sustainability embedded – not bolted on.",
        "Lead sustainability transformation with science-based targets, net-zero warehousing and low-carbon transport solutions that support green goals."
      ]
    },
    {
      "title": "2. Trusted to deliver.",
      "source": "Magnus – Value Proposition Angles AG Barr_V2.pdf, p. 5–6",
      "bullets": [
        "Growth means nothing without consistency. DHL brings the resilience, control and confidence to keep products moving and customers satisfied – no matter the pressure.",
        "Safeguard business continuity through cyber-secure, risk-managed networks recognised for operational resilience and excellence under pressure.",
        "Streamline operations with an integrated, single-provider model that brings design, transport and co-packing into one accountable chain.",
        "Build credibility with real-time insight, open-book operations and service innovation – backed by a trusted and leading partner, as recognised by Gartner."
      ]
    }
  ],
  "personaResonance": [
    {
      "persona": "Supply Chain Officer / Director",
      "source": "Magnus Consulting_DHL AG Barr_VP and DMU Workshop Summary.pdf, p. 1–2",
      "priorities": [
        "Production continuity: keep manufacturing running without disruption",
        "Infrastructure readiness: capacity that meets current and future needs",
        "Growth capacity: scalable solutions that enable expansion"
      ],
      "resonance": "\"Space to expand today. Confidence it lasts tomorrow.\" – highlights scalability, flexible capacity, and operational readiness."
    },
    {
      "persona": "CFO / COO",
      "source": "Magnus Consulting_DHL AG Barr_VP and DMU Workshop Summary.pdf, p. 1–2",
      "priorities": [
        "Growth ambitions realised with maximum operational effectiveness",
        "Retailer service agreements met to avoid penalties and reputational risk",
        "Capital efficiency: lower investment risk with flexible, phased growth"
      ],
      "resonance": "\"Trusted to deliver.\" – reinforces reliability, efficiency, and open-book transparency that safeguard capital and reputation."
    },
    {
      "persona": "CEO (and Sustainability)",
      "source": "Magnus Consulting_DHL AG Barr_VP and DMU Workshop Summary.pdf, p. 1–2",
      "priorities": [
        "Business growth delivered responsibly",
        "Brand protection and retailer confidence",
        "Sustainability goals: progress on Scope 3 reductions, enabling focus on Scope 1 and 2"
      ],
      "resonance": "\"Space to expand today…\" – aligns to sustainable expansion; sustainability embedded, not bolted on."
    }
  ]
}

